[
  {
    "job_title": "Technical Sales Engineer",
    "description": "Proficiency with MICROSOFT OFFICE/OFFICE 365 environment and software, prior experience and proficiency with CRMs. Executing with SPEED and ACCURACY.&hellip;",
    "skills": []
  },
  {
    "job_title": "Middle QA Software Engineer",
    "description": "Strong understanding of software development lifecycles (SDLC) and QA methodologies. Identify, document, and track software defects using tools like Jira.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "Remote (Work From Home) Contract. Advertising, Media & Communications NGN 900,000 - 1,200,000. Build and maintain custom Shopify API integrations to enable real…&hellip;",
    "skills": []
  },
  {
    "job_title": "Sound Engineer (Mix and Mastering DJ sets)",
    "description": "Candiates are also expected to know how to edit/enhance voiceovers and apply the relevant SFX to make voiceovers distinctive. Work with teams to master DJ sets.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer (Backend)",
    "description": "We're seeking a Software Engineer to design, develop, and maintain our server-side applications while ensuring robust infrastructure and deployment processes.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "The Software Engineer will be responsible for back-end web development, software development, programming, and object-oriented programming.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer - Nigeria",
    "description": "Professional experience building and maintaining live systems. Professional experience with client- and server-side Javascript, and document-oriented databases …&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer (Laravel) - Remote, Poland",
    "description": "Collaborate with project stakeholders to ensure that client business needs are met through the software we develop. Debug and fix bugs across our integrations.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "It is a full time job for the position of a software developer in the company. Banking, Finance & Insurance NGN 150,000 - 250,000.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "Banking, Finance & Insurance NGN 250,000 - 400,000. The ideal candidate will be responsible for designing, developing, and maintaining user-friendly and…&hellip;",
    "skills": []
  },
  {
    "job_title": "React Native Software Engineer",
    "description": "Integrate software components into a fully functional software system. Document and maintain software functionality. Git repository and CI flows.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "Troubleshoot and debug software issues. Continuously improve software development processes and methodologies. 3+ years of experience in software development.&hellip;",
    "skills": []
  },
  {
    "job_title": "Project Engineer",
    "description": "Proficient in project management software and other relevant tools. Team Coordination: Collaborate with cross-functional teams, including architects, engineers,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Enterprise Software Implementation Engineer",
    "description": "Work with a talented and supportive team on exciting and complex enterprise security software solutions. Provide training to clients on how to use the software,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "Artificial intelligence (AI) and machine learning processes and solutions. Data analysis and big data cloud pipelines in collaboration with our Data Scientist…&hellip;",
    "skills": [
      "cloud",
      "data analysis"
    ]
  },
  {
    "job_title": "Middle Front End Developer (React/TypeScript)",
    "description": "Collaborate with other developers and engineers to design, build, and maintain application features. We develop and constantly improve the best intranet design…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Developer",
    "description": "Web Application development using web technologies (HTML, DHTML, CSS, JavaScript, XML, SQL, AJAX, PHP). Programming in JAVA and/or PHP.&hellip;",
    "skills": [
      "php",
      "css",
      "javascript",
      "java",
      "sql",
      "html"
    ]
  },
  {
    "job_title": "QA Engineer",
    "description": "Experience in creating test cases and conducting software testing. The QA Engineer will be responsible for test execution, quality assurance, manual testing,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Java Developers",
    "description": "As a Hardcore Biometric Systems Software Engineer you will participate in all aspects of the software development lifecycle which includes requirement analysis,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "Minimum of 5 years of professional experience in mobile development. Proven expertise in React Native , with a portfolio of successful iOS and Android apps.&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Architect",
    "description": "Proficiency in architectural software (AutoCAD, Revit, SketchUp, etc.). You will collaborate closely with clients, engineers, and construction teams to bring…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Developer/Engineer",
    "description": "Integrate network management software with existing systems and tools for seamless operation. Technical Support: Provide helpdesk support for hardware and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer (Drupal) - Remote, Poland",
    "description": "Attention to detail when building resilient software. Collaborate with project stakeholders to ensure that client business needs are met through the software…&hellip;",
    "skills": []
  },
  {
    "job_title": "Desktop Engineer",
    "description": "Minimum of 3 years experience in a desktop engineer role. Perform regular system updates, patches, and software installations as required.&hellip;",
    "skills": []
  },
  {
    "job_title": "QA/SOFTWARE TESTER",
    "description": "Execute manual and automated test cases to validate software functionality and performance. Strong attention to detail and ability to identify defects in…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Quality Assurance Engineer",
    "description": "4+years overall commercial software experience at the enterprise level. Collaborate with team members and business stakeholders to define acceptance criteria…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Designer",
    "description": "Proficient in MS office software. Gather and evaluate user requirements in collaboration with product managers and engineers. Bias toward outcomes over output.&hellip;",
    "skills": []
  },
  {
    "job_title": "Site Engineer",
    "description": "Proficiency in relevant software and tools. This is a full-time on-site role for a Site Engineer. The Site Engineer will oversee all aspects of day-to-day…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mid-level Software Engineers",
    "description": "We are looking for software engineers who are builders and makers at heart. We value engineers who: Pay attention to detail Show commitment to the craft Who…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Software Developer",
    "description": "You will be working closely with other engineers, designers, product managers, user experience researchers, and customer groups to build features and high…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graduate Trainee Engineer",
    "description": "Knowledge of circuit design softwares i.e Protuse/Diptrace/Eagle. Design, build, analyze, and troubleshoot electrical components, sub-assemblies and products.&hellip;",
    "skills": []
  },
  {
    "job_title": "Maintenance Assistant, Maiduguri",
    "description": "Proficiency in the use of Auto CAD, MS Office and maintenance softwares. Maintenance / Inspection / Technologies, Moyens Généraux.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer: UI",
    "description": "O Apply best software development practices to coding software solutions. O Working closely with key stakeholders particularly with team leads and software…&hellip;",
    "skills": []
  },
  {
    "job_title": "Lead, Front End Software Engineer, Remote",
    "description": "The Lead Front-End Developer will use their existing leadership skills to contribute to a high performing and effective agile development team.&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend Engineer (React.js & Next.js)",
    "description": "In this role, you will work closely with our backend developers, designers, and product managers to deliver exceptional user interfaces that ensure optimal…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Software Engineer, Frontend (React) - Remote, Poland",
    "description": "A fast-paced, friendly, collaborative and hybrid/flexible working environment. The engineering team sits at the centre of everything we do at Plentific and is…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "Design, test and implement software which forms part of a properly engineered system. Experience with office management software like MS Office (MS Excel,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Solar Engineer",
    "description": "Proficient in solar design software (e.g., PVsyst, AutoCAD). You will work closely with senior engineers and project managers to ensure projects are completed…&hellip;",
    "skills": []
  },
  {
    "job_title": "SITE ENGINEER",
    "description": "Proficiency in design and visualization software (e.g., AutoCAD, Revit, or similar). The construction site supervisor will be involved in the supervision of…&hellip;",
    "skills": []
  },
  {
    "job_title": "Chief Software Engineer",
    "description": "Engage in technical discussions and decision-making to improve software architecture and design. Architect, implement, and optimize CI/CD pipelines to enhance…&hellip;",
    "skills": []
  },
  {
    "job_title": "Site Engineer",
    "description": "Liaise with architects, engineers, and contractors to address technical issues and ensure alignment on project goals.&hellip;",
    "skills": []
  },
  {
    "job_title": "Cloud Engineer (Linux)",
    "description": "Build software with robust and scalable architectures with a focus on cloud environments; The Cloud Engineer will be responsible for software development,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Site Engineer",
    "description": "Familiarity with construction management software and tools. Coordinate and communicate with project managers, architects, engineers, and subcontractors.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Software Engineer",
    "description": "Net engineer who will take a key role the software development team leading and working alongside engineers to build enterprise scale applications.&hellip;",
    "skills": []
  },
  {
    "job_title": "QA ENGINEER",
    "description": "You will collaborate closely with developers to identify and resolve bugs, maintaining high-quality software releases and ensuring a seamless user experience.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer (Hybrid Position)",
    "description": "Minimum of *5+ years of software development experience*, with a strong portfolio of completed software projects showcasing your technical expertise and problem…&hellip;",
    "skills": []
  },
  {
    "job_title": "Network Engineer",
    "description": "Creating firewalls and updating virus protection software and data security systems to keep data and communications protected.&hellip;",
    "skills": []
  },
  {
    "job_title": "Construction Manager",
    "description": "Proficiency in project management tools and software. Collaborate with architects, engineers, contractors, and other stakeholders to resolve project challenges.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "A senior programmer for the LGTNigeria software run-time. Utilizes in-depth knowledge of computer science, software engineering, applied mathematical skills,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Information Technology Engineer",
    "description": "Updating and Maintaining OS and software to the latest releases, patches etc.. Installation of OS and required service packages: both open source and…&hellip;",
    "skills": []
  },
  {
    "job_title": "QA Engineer",
    "description": "Proficiency in software testing tools for Web applications, including Selenium. The successful candidate will be responsible for manual testing, automated…&hellip;",
    "skills": []
  },
  {
    "job_title": "Petroleum Engineer",
    "description": "Familiarity with industry software such as Petroleum Expert or Eclipse. Collaborate with geologists and other engineers to enhance the understanding of…&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend Engineer",
    "description": "Collaborate with project managers, software engineers, and business partners for work planning, sharing innovative ideas, code demonstrations, troubleshooting,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Transport Engineer",
    "description": "A construction and engineering company on Lagos mainland requires the services of a transport engineer. Proficiency in using software tools such as AutoCAD,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Infrastructure Engineer",
    "description": "We are seeking an experienced *Infrastructure Engineer *with at least 4 years of hands-on experience designing, deploying, and managing scalable server…&hellip;",
    "skills": []
  },
  {
    "job_title": "Transmission Support Engineer",
    "description": "Working as a support engineer will require a broad knowledge within telecom and Datacom, covering both hardware, software and network knowledge.&hellip;",
    "skills": []
  },
  {
    "job_title": "Back End Developer",
    "description": "Experience leading technical initiatives and mentoring other engineers. 5+ years of experience in back-end software engineering.&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Engineer (Mid-level)",
    "description": "You will work with a team of skilled engineers and collaborate across departments to create robust, scalable, and highly available quality software systems.&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend Developer",
    "description": "As a Frontend Engineer, you will ensure the alignment of web design and user experience requirements, optimise web pages for maximum efficiency, and maintain…&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Scientist",
    "description": "Strong communication skills for presenting data-driven insights effectively. Collaborate with cross-functional teams to define data requirements and deliver…&hellip;",
    "skills": []
  },
  {
    "job_title": "Medical Laboratory Scientist",
    "description": "Familiarity with laboratory equipment, diagnostic software, and data analysis tools. Ability to analyze data, solve problems, and make informed decisions based…&hellip;",
    "skills": []
  },
  {
    "job_title": "Python Data Scientist",
    "description": "S/he will support the data team in the automation of the collection and analysis of data. Development and maintenance of data pipeline processes.&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Scientist",
    "description": "Work with data engineering teams to ensure data is collected and stored effectively for analysis. Build and maintain data pipelines to ensure the availability…&hellip;",
    "skills": []
  },
  {
    "job_title": "Research Scientist - Kano",
    "description": "Identify and develop data collection and data analysis strategies. The research scientist researches critical information/data on project performance and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Private Data Analytics / Data Science Tutor (Remote)",
    "description": "Practical data engineering and big data tools. Stay updated with industry trends, best practices, and tools used by data analysts, scientists, and engineers.&hellip;",
    "skills": []
  },
  {
    "job_title": "Medical Laboratory Scientist/Microbiologist",
    "description": "Data Protection Laws: Protect patient privacy and ensure that clinic data and lab results are processed and stored in accordance with data protection laws of…&hellip;",
    "skills": []
  },
  {
    "job_title": "Consultant Microbiologist",
    "description": "Supervising and mentoring other scientists and technicians. Designing and executing experiments, analyzing data, and preparing reports. 10 days on; 20 days off.&hellip;",
    "skills": []
  },
  {
    "job_title": "Lab Scientist",
    "description": "Collaborate with other scientists, researchers, and healthcare professionals as needed. Prepare and analyze samples, record data, and interpret results…&hellip;",
    "skills": []
  },
  {
    "job_title": "AI Engineer",
    "description": "Collaborate with data scientists, engineers, and product teams to identify opportunities for AI-driven solutions. Strong communication and collaboration skills.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Data Scientist",
    "description": "Ensure data integrity and compliance with relevant regulations and ethical standards. Conduct rigorous data analysis to inform decision-making and present…&hellip;",
    "skills": []
  },
  {
    "job_title": "Machine Learning Engineer/ Data Scientist with R certification + PL-400",
    "description": "Experience with data preprocessing, feature engineering, and data visualization techniques. Conduct exploratory data analysis, preprocess and clean data, and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Engineer (Mid to Senior Level) – Remote (Nigeria)",
    "description": "Collaborate with data scientists, analysts, and software engineers to deliver data products. Design and implement data warehouses, data lakes, and real-time…&hellip;",
    "skills": []
  },
  {
    "job_title": "Quality Assurance Engineer",
    "description": "Collaborate closely with developers, product managers, data scientist and designers to understand requirements and define quality standards.&hellip;",
    "skills": []
  },
  {
    "job_title": "Medical Laboratory Technician & Admin and Customer Relation",
    "description": "Basic computer skills for data entry and medical record maintenance. The ideal candidate will draw blood from patients for diagnostic purposes and analyse RDT…&hellip;",
    "skills": []
  },
  {
    "job_title": "Back-End Developer",
    "description": "You will manage the data interchange between the site/software users and servers. The candidate will also have experience integrating multiple databases and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Soil Scientist",
    "description": "Experience with GIS software (e.g., ArcGIS) and data analysis tools. Use GIS and remote sensing tools to interpret and visualize soil data.&hellip;",
    "skills": []
  },
  {
    "job_title": "Project Manager",
    "description": "Lead and manage the R&D team, ensuring seamless collaboration between AI/ML engineers, data scientists, and developers. A Master’s degree is a plus.&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Engineer",
    "description": "Liaise with data scientists and analysts to improve and provide data as required. Responsible for the designing, developing, optimizing, and standardizing of…&hellip;",
    "skills": []
  },
  {
    "job_title": "AI / Machine Learning Engineer (Senior Level) – Remote (Nigeria)",
    "description": "The role involves collaborating closely with data scientists and engineers to build scalable machine learning models, optimize algorithms, and integrate AI into…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "Work with data scientists and analysts to improve software. Create security and data protection settings. Remote (Work From Home) Full Time.&hellip;",
    "skills": []
  },
  {
    "job_title": "Artificial Intelligence/Machine Learning Engineer",
    "description": "Work closely with data scientists and analysts to create and deploy new product features. Strong knowledge of data pipeline and workflow management tools.&hellip;",
    "skills": []
  },
  {
    "job_title": "Machine Learning Engineer",
    "description": "Proficiency in data manipulation libraries such as pandas. Work with large datasets and ensure data quality and integrity. Remote (Work From Home) Full Time.&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Development Engineer/ Product Development Scientist",
    "description": "Excellent analytical and quantitative skills with data driven approach. The RENOLIT Group stands for partnership-based service, an international focus and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Engagement Manager",
    "description": "Capture feedback and provide product specs and overviews of analyses needed to data team to productise our data offering.&hellip;",
    "skills": []
  },
  {
    "job_title": "AI & Machine Learning Engineer",
    "description": "Understanding of data structures, data modelling and software engineering best practices. You will work with a wide variety of clients to deliver the latest…&hellip;",
    "skills": []
  },
  {
    "job_title": "Call for Application for Masters Students to conduct Research within the NORA Research Project",
    "description": "An advanced mentoring concept which gives scientists confidence to develop their individual research profiles. Research experience will be an added advantage.&hellip;",
    "skills": []
  },
  {
    "job_title": "Pharmaceutical Technologist",
    "description": "Years of Experience : 2+ years. Accurately dispense prescription medications in accordance with physician orders and regulatory guidelines.&hellip;",
    "skills": []
  },
  {
    "job_title": "Diagnostic Centre Manager",
    "description": "Analyze data to improve service offerings and profitability. The Diagnostic Centre Manager is responsible for overseeing the daily operations of a diagnostic or…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "Work with data scientists and analysts to improve software. As a Full-stack developer, you will be responsible for producing scalable software solutions.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "Data analysis and big data cloud pipelines in collaboration with our Data Scientist team. Artificial intelligence (AI) and machine learning processes and…&hellip;",
    "skills": [
      "cloud",
      "data analysis"
    ]
  },
  {
    "job_title": "Data Science Manager",
    "description": "Lead and mentor a team of data scientists, providing guidance on best practices in data analysis, machine learning, and statistical modeling.&hellip;",
    "skills": [
      "machine learning",
      "data analysis"
    ]
  },
  {
    "job_title": "Senior Piping Designer",
    "description": "Deliver piping discipline specific design and drafting services that meet Worley, the client’s and applicable statutory and regulatory requirements.&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile Application Developer",
    "description": "Collaborate with other professionals such as data scientists and software engineers to design and build advanced applications.&hellip;",
    "skills": []
  },
  {
    "job_title": "Digital Marketing Specialist",
    "description": "A creative strategist and tactical executor who can: Build high-converting funnels and drive growth across digital channels.&hellip;",
    "skills": []
  },
  {
    "job_title": "Research Scientist - Financial Inclusion at Scale",
    "description": "Experience with structured or unstructured data. Research freedom: Publish, attend conferences, and collaborate with academic institutions while solving…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior/Staff Machine Learning Engineer",
    "description": "Work closely with data scientists, engineers, and stakeholders to drive end-to-end model development and deployment. Design, Develop, and Train ML Models:&hellip;",
    "skills": []
  },
  {
    "job_title": "Job Vacncies at Falcon Peak Solutions Limited",
    "description": "Support the pharmacy team with administrative tasks, including filing, data entry, and report generation. Our client is seeking experienced Pharmacy Technicians…&hellip;",
    "skills": []
  },
  {
    "job_title": "Database Engineer & Business Intelligence Officer",
    "description": "*Collaboration with Cross-Functional Teams*: Work closely with IT teams, data scientists, and business stakeholders to understand data needs and develop…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Piping Engineer",
    "description": "Ensures team member adherence to generally accepted engineering and design practices, regulatory requirements, and customer specifications.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Product Manager - Lending Platform",
    "description": "Partnering with data scientists and analysts to understand user needs and implement novel methodologies. Nice to have: Experience with data science models.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Data Science Manager",
    "description": "You will lead a talented team of data scientists, driving innovation in predictive modeling, machine learning, and advanced analytics.&hellip;",
    "skills": []
  },
  {
    "job_title": "Head of Medical Physics",
    "description": "The candidate may also request corrections or updates to your data to ensure accuracy and relevance. Staff Development: Manage the recruitment, training, and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Network for Oncology Research in Sub-Saharan Africa (NORA) Call for Application for Masters, Ph.D. and Postdoctoral Students to conduct Research within the NORA Research Project",
    "description": "An advanced mentoring concept which gives scientists confidence to develop their individual research profiles. Research project and tuition support.&hellip;",
    "skills": []
  },
  {
    "job_title": "DS Senior Campaign Manager",
    "description": "Collaborate with data scientists and analysts to implement advanced analytical models that enhance targeted marketing efforts and optimize customer interactions…&hellip;",
    "skills": []
  },
  {
    "job_title": "DevOps (Systems Administrator) Engineer",
    "description": "The COVID-19 pandemic upturned closely held assumptions everywhere. To reliably deploy solutions in the cloud, ensuring a seamless hand-off of code releases…&hellip;",
    "skills": []
  },
  {
    "job_title": "SDET – Software QA Automation",
    "description": "Collaborate closely with product managers, engineers, and designers to identify acceptance criteria and define test coverage.&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior DevOps Engineer",
    "description": "Job Type:* Full-Time (On-site). As a *Junior DevOps Engineer*, you will assist in building, deploying, and maintaining our CI/CD pipelines, cloud infrastructure…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mid DevOps Engineer",
    "description": "To reliably deploy solutions in the cloud, ensuring a seamless hand-off of code releases between software engineering (Dev) and IT Operations (Ops).&hellip;",
    "skills": []
  },
  {
    "job_title": "Infrastructure / Cloud / DevOps Engineer (Junior Associate)",
    "description": "Managing organisational and client Infrastructure including but not limited to Amazon Web Services (AWS) , Google Cloud (GCP) , Azure , Digital Ocean, Hostgator…&hellip;",
    "skills": [
      "azure",
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "Mid-level DevOps Engineer",
    "description": "Experience with Kubernetes in production environments. Working knowledge of Continuous Integration (CI/CD) tools like Jenkins.&hellip;",
    "skills": []
  },
  {
    "job_title": "Middle DevOps",
    "description": "You will be part of the team developing a new solution for the client - a big name in the travel industry. 5+ years working in Software Development/Information…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Azure DevOps Engineer",
    "description": "This role involves working closely with development, operations, and security teams to ensure efficient and secure deployment of applications and services.&hellip;",
    "skills": []
  },
  {
    "job_title": "Devops Engineer",
    "description": "Experience as a DevOps engineer Proficiency with Git and GitHub workflows Good knowledge of Ruby or Python Working knowledge of databases and SQL Problem-…&hellip;",
    "skills": [
      "python",
      "git",
      "sql"
    ]
  },
  {
    "job_title": "DevOps Engineer",
    "description": "Also, you will be required to have strong presentation, verbal communication and written communications skills. Net, C++ or similar object-oriented language.&hellip;",
    "skills": []
  },
  {
    "job_title": "DevOps Engineer",
    "description": "Document processes and mentor junior engineers. Contract Type:* Project-Based Contract. This is a *flexible, project-based contract role*.&hellip;",
    "skills": []
  },
  {
    "job_title": "DevOps Engineer",
    "description": "Ecobank Transnational Incorporated (ETI), a public limited liability company, was established as a bank holding company in 1985 under a private sector…&hellip;",
    "skills": []
  },
  {
    "job_title": "DevOps Engineer",
    "description": "The DevOps Engineers responsibilities are multi-prong, you need to be agile enough to wear a technical hat and manage operations simultaneously.&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Infrastructure/ DevOps / Systems Engineer Trainee (June 2025)",
    "description": "This is a short term internship ( 6 months – 1 year contract) position. Suitable for industrial attachment (minimum 6 months), NYSC and Fresh Graduates.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior DevOps Engineer",
    "description": "Lead and mentor a small team of engineers across DevOps, SecOps, and IT compliance functions. ⁠Create, manage, and maintain software deployment pipelines using…&hellip;",
    "skills": []
  },
  {
    "job_title": "DevOps Engineer",
    "description": "Successful candidate must be agile enough to wear a technical hat and manage operations simultaneously. You are passionate about excellent communication and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Cybersecurity Engineer",
    "description": "We are looking for a highly capable *Cybersecurity Engineer* to lead and strengthen our security posture across digital platforms and infrastructure.&hellip;",
    "skills": []
  },
  {
    "job_title": "DevOps Engineer",
    "description": "Python Terraform zure DevOps AWS CodeDeploy Jenkins GCP UNIX LINUX Zapier Make CICD Datadog AI GPT DNS VPN Networking Docker Kubernetes AWS Azure.&hellip;",
    "skills": [
      "python",
      "linux",
      "aws",
      "docker",
      "networking"
    ]
  },
  {
    "job_title": "DEVOPS ENGINEERS",
    "description": "As a part of our team you will be responsible for ensuring system stable operations across board. The project is centered on the development of a service that…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "*Full Stack Development:* Analyze, design, prototype, develop, test, troubleshoot, support, maintain and update the complete software lifecycle in your hands at…&hellip;",
    "skills": []
  },
  {
    "job_title": "Devops Engineer/Linux Administrator",
    "description": "We are looking for an experienced DevOps Engineer/Linux Administrator to build functional systems that improve customer experience, and collaborate with…&hellip;",
    "skills": []
  },
  {
    "job_title": "DevOps Engineer",
    "description": "We are looking to engage a competent and experienced DevOps Engineer who will be responsible for Applications Management, Software Development, exploring…&hellip;",
    "skills": []
  },
  {
    "job_title": "Industrial Attachment Vacancies (Internship)",
    "description": "This position is suitable for students currently seeking a place to undertake their Industrial Attachment Training (6 months or 1 year).&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "The ideal candidate is a *well-rounded engineer* who thrives on solving complex problems, shipping complete products, and working across the stack—from backend…&hellip;",
    "skills": []
  },
  {
    "job_title": "Systems Engineer - Nigeria",
    "description": "Currently works or have previously worked in a pre-sales engineer role, managing end to end technical aspects of deals, through to technical closure.&hellip;",
    "skills": []
  },
  {
    "job_title": "Quality Assurance Engineer",
    "description": "You’ll design and implement scalable, automated testing systems and perform thorough exploratory testing to ensure a flawless user experience.&hellip;",
    "skills": []
  },
  {
    "job_title": "DevOps Engineer",
    "description": "Ensure reliable, fast, and efficient software delivery by enabling continuous integration, continuous delivery (CI/CD), and infrastructure automation.&hellip;",
    "skills": []
  },
  {
    "job_title": "SOC Analyst (Defensive Engineer)",
    "description": "In this role, you will be responsible for monitoring security tools such as SIEM and EDR for indicators of compromise, developing and refining detection rules,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Systems Engineer Trainee (Internship)",
    "description": "This is a short term internship ( 6 months – 1 year contract) position. Suitable for industrial attachment (minimum 6 months), NYSC and Fresh Graduates.&hellip;",
    "skills": []
  },
  {
    "job_title": "Information System Engineer",
    "description": "\\*\\*FULL TIME ONLY, NO PART-TIMERS/FREELANCERS/ STUDENTS\\*\\**. At least 6 years of work experience as a Systems Engineer with strong expertise in the following…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Infrastructure & DevOps Engineer",
    "description": "We operate in fast-paced, high-growth environments that require agile thinking, strong engineering fundamentals, and a deep understanding of telecom, fintech,…&hellip;",
    "skills": []
  },
  {
    "job_title": "AI/ML Engineer",
    "description": "Punch is a full-service digital agency dedicated to creating exceptional digital experiences. Study and transform data science prototypes into scalable…&hellip;",
    "skills": []
  },
  {
    "job_title": "Cloud Infrastructure Engineer",
    "description": "You must have a strong knowledge of engineering your way around Microsoft Azure and on-premises environments. Identify: Identify the organizational impact (for…&hellip;",
    "skills": []
  },
  {
    "job_title": "AI & Machine Learning Engineer",
    "description": "You will work with a wide variety of clients to deliver the latest data science and big data technologies. Your teams will design and build scalable solutions…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer",
    "description": "As a Software Engineer specializing in back-end development, you will build new product features from start to finish (e.g. develop & deploy new demand models…&hellip;",
    "skills": []
  },
  {
    "job_title": "n8n Automator & AI Workflow Engineer (OpenAI Integration)",
    "description": "We are seeking a proactive and detail-oriented n8n Automator & AI Workflow Engineer to design, build, and maintain robust automation workflows using n8n, with a…&hellip;",
    "skills": []
  },
  {
    "job_title": "Tech Recruiter",
    "description": "Design and implement cutting-edge technical recruitment strategies to attract top developers, engineers, and IT professionals.&hellip;",
    "skills": []
  },
  {
    "job_title": "Al Engineer",
    "description": "The ideal candidate must have knowledge or coursework in topics such as software engineering, artificial intelligence, machine learning and Natural Language…&hellip;",
    "skills": []
  },
  {
    "job_title": "Head, Cloud Engineer",
    "description": "Job Type:* Full-Time (On-site). As *Head, Cloud Engineer*, you will manage the operations of the entire Technical Department of Cybercloud.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Full Stack Developer",
    "description": "Collaborate with cross-functional teams including developers, product managers, and DevOps engineers. We’re seeking a Senior Fullstack Developer with strong…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Engineer (Python)",
    "description": "Collaborate with cross-functional teams including frontend engineers and product managers. Employment Type: Full-time (Onsite). CI/CD and DevOps experience.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "Artificial intelligence (AI) and machine learning processes and solutions. Data analysis and big data cloud pipelines in collaboration with our Data Scientist…&hellip;",
    "skills": [
      "cloud",
      "data analysis"
    ]
  },
  {
    "job_title": "BI / Data Analyst (Mid to Senior Level)",
    "description": "We are looking for a highly motivated and technically proficient BI / Data Analyst (Mid to Senior Level) to design, build, and optimize data pipelines and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Infrastructure & Data Engineer",
    "description": "You will work closely with our development teams in Nigeria Kenya and Europe, supporting them with deployment and hosting infrastructure, designing solutions to…&hellip;",
    "skills": []
  },
  {
    "job_title": "Cloud Network Engineer",
    "description": "We are seeking a Cloud Network Engineer with strong expertise in AWS, networking, and IT infrastructure to design, deploy, and manage a robust, secure, and…&hellip;",
    "skills": [
      "cloud",
      "aws",
      "networking"
    ]
  },
  {
    "job_title": "Backend Engineer",
    "description": "5+ years of experience with Python/Node. 5+ years of experience with Django Rest Framework. Strong experience writing test cases and TDD.&hellip;",
    "skills": [
      "python",
      "node",
      "django"
    ]
  },
  {
    "job_title": "IT Infrastructure Officer",
    "description": "IT Infrastructure Engineer* will design, implement, and maintain hybrid IT infrastructure, which includes AWS, Azure, on-premises data centers, Linux systems,…&hellip;",
    "skills": [
      "linux",
      "azure",
      "aws"
    ]
  },
  {
    "job_title": "Data Engineer",
    "description": "Responsible for the designing, developing, optimizing, and standardizing of batch and stream data pipelines, data platform and administration, data governance,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Tester/QA Engineer",
    "description": "The role will be able to assess software quality through a combination of manual and automated testing. They will be able to identify and report bugs and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full stack engineer",
    "description": "The ideal candidate will be responsible not only for software development but also for platform maintenance, user training, feature upgrades, and IT support…&hellip;",
    "skills": []
  },
  {
    "job_title": "Solutions Architect",
    "description": "We’re especially interested in individuals who embrace modern AI tools and patterns as part of their daily workflows. A mentor for a probation period.&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Engineer (Remote) - Darsel (EdTech Nonprofit)",
    "description": "Darsel is looking for a *backend engineer* to accelerate our development efforts and help launch new products, with a strong focus on generative AI applications…&hellip;",
    "skills": []
  },
  {
    "job_title": "Head of Training",
    "description": "Work closely with department heads, product managers, and engineers to understand evolving training needs and technology trends.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Software Engineer",
    "description": "Net engineer who will take a key role the software development team leading and working alongside engineers to build enterprise scale applications.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Platform Engineer",
    "description": "Help cultivate the engineering organization e.g. engineer interviews, peer mentoring, and technical evangelism.&hellip;",
    "skills": []
  },
  {
    "job_title": "Lead QA Engineer",
    "description": "Punch is a full-service digital agency on a mission to build the best digital experiences. Responsible for initiating and ensuring the technical and delivery-…&hellip;",
    "skills": []
  },
  {
    "job_title": "Cloud Solutions Architect (Senior Level) – Remote (Nigeria)",
    "description": "Provide mentorship to junior architects and cloud engineers. Role Summary:* As a Senior Cloud Solutions Architect, you will lead the design and deployment of…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Azure Cloud Engineer",
    "description": "We are hiring a *Senior Azure Cloud Engineer (Contract)* to support one of our key U.S.-based technology partners. Cloud Engineering: 5 years (Required).&hellip;",
    "skills": [
      "azure",
      "cloud"
    ]
  },
  {
    "job_title": "Bincom Dev Center Tech/Software Training Facilitator (Freelance/Part-Time)",
    "description": "This is a part-time/freelance role for individuals able to commit to learning and development of the next generation of technology experts and software…&hellip;",
    "skills": []
  },
  {
    "job_title": "Platform Engineer (L4)",
    "description": "Technical Leadership: Lead the technical implementation of cloud platform solutions in client projects, ensuring scalable, reliable, and secure architectures…&hellip;",
    "skills": []
  },
  {
    "job_title": "DevOps (Systems Administrator) Engineer",
    "description": "Design security architecture and implement systems to ensure host systems are safe and secure against cybersecurity threats. Job Types: Full-time, Permanent.&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Administrator (ERP Systems)",
    "description": "Conduct routine data backups and disaster recovery testing for ERP-related systems. Monitor system performance, troubleshoot issues, and ensure maximum uptime…&hellip;",
    "skills": []
  },
  {
    "job_title": "School Administrator",
    "description": "They are seeking a School Administrator who will actively promote a staff culture that emphasises employee satisfaction, professionalism, high performance,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Admin and Customers Service Officer",
    "description": "Plan and coordinate administrative procedures and systems and devise ways to streamline processes. Responsible for supervising daily operations of the company,…&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Systems Administrator Lead",
    "description": "Perform regular system updates, backups, and implement disaster recovery procedures to ensure business continuity.&hellip;",
    "skills": []
  },
  {
    "job_title": "ADMINISTRATIVE OFFICER",
    "description": "Organize a filing system for important and confidential company documents. The Administrative Officer will act as the point of contact for all employees,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Assistant Store Administrator",
    "description": "Ability to perform simple arithmetic calculations and operate and enter information in a computerized inventory system. Coordinating and time management skills.&hellip;",
    "skills": []
  },
  {
    "job_title": "Network Administrator",
    "description": "Configure and maintain network security technologies, such as intrusion detection and prevention systems, antivirus software, and security information and event…&hellip;",
    "skills": []
  },
  {
    "job_title": "Dashboard Operator/Administrator",
    "description": "Identify and resolve system issues promptly. Support administrators and customer service teams as needed. Banking, Finance & Insurance NGN 150,000 - 250,000.&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Administrator",
    "description": "(Optional) Familiarity with Linux operating systems. Provide technical support for software applications (e.g., policy administration systems, claims management…&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Network, Security & Datacentre Administrator",
    "description": "➢ Administer security-related systems such as VPN servers, firewalls, intrusion detection systems, and network monitoring systems.&hellip;",
    "skills": []
  },
  {
    "job_title": "Network/System Administrator",
    "description": "Monitor system performance and troubleshoot issues to ensure uptime and efficiency. Manage antivirus, anti-malware, and intrusion detection/prevention systems.&hellip;",
    "skills": []
  },
  {
    "job_title": "System Administrator",
    "description": "Maintain proper licensing for software and IT systems. Ensure systems comply with security protocols and organizational policies. Share the AMCE’s vision.&hellip;",
    "skills": []
  },
  {
    "job_title": "Database Administrator/ Data Analyst",
    "description": "Install, configure, and maintain database systems (e.g., MySQL, SQL Server, Oracle, PostgreSQL). We are seeking a highly skilled and detail-oriented Database…&hellip;",
    "skills": []
  },
  {
    "job_title": "System Administrator",
    "description": "In-depth knowledge of UNIX/Linux operating systems, shell scripting, system administration tools, and network protocols. Pay: From ₦350,000.00 per month.&hellip;",
    "skills": []
  },
  {
    "job_title": "Business Support Administrator, Ikoyi, Lagos",
    "description": "‎Overseeing the upkeep and repair of the facility's physical assets, including buildings, equipment and systems ‎Responsible for the efficient management and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Base Administrator",
    "description": "Design, install, configure, and maintain scalable database systems (e.g., PostgreSQL, MySQL, MongoDB, Redis, SQL Server). IT & Telecoms NGN 600,000 - 900,000.&hellip;",
    "skills": []
  },
  {
    "job_title": "Cybersecurity Administrator / Ethical Hacker",
    "description": "Conduct regular vulnerability assessments and penetration testing on company networks, applications, and systems to identify security weaknesses.&hellip;",
    "skills": []
  },
  {
    "job_title": "Project Administrator",
    "description": "Maintain organized and efficient filing systems and databases for both print and electronic documentation related to program activities.&hellip;",
    "skills": []
  },
  {
    "job_title": "Office Admin",
    "description": "Maintain organized filing systems and office supplies. Banking, Finance & Insurance NGN 75,000 - 150,000 Negotiable. Schedule meetings and manage calendars.&hellip;",
    "skills": []
  },
  {
    "job_title": "Hospital Manager/Administrator",
    "description": "Develop and implement administrative systems, policies, and procedures. We require a Hospital Manager/ Administrator in Lagos and Abuja.&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Database Administrator",
    "description": "Testing new database and data systems. Certifications in the leading database management systems, i.e., Oracle, Microsoft SQL Server, IBM DB2, Sybase and MySQL.&hellip;",
    "skills": []
  },
  {
    "job_title": "Contract Administrator",
    "description": "Create Service Entries for Production Operations contract agreements existing on Company’s SAP system. Responsible for stewarding and administering vendor…&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Administrator",
    "description": "Proficient in HTML, CSS, JavaScript, and web content management systems (CMS). Update web content regularly using content management systems (CMS) to reflect…&hellip;",
    "skills": [
      "css",
      "javascript",
      "html"
    ]
  },
  {
    "job_title": "IT EXECUTIVE",
    "description": "Conduct physical verification of IT assets in conjunction with system administrator and maintain a register of all assets.&hellip;",
    "skills": []
  },
  {
    "job_title": "Learning Administrator",
    "description": "Organize Quizzes for students preparing to write the CBT Exam. Organize Teaching Materials in PDF Format, for visual learners. Build and Organize Lead Database.&hellip;",
    "skills": []
  },
  {
    "job_title": "Administrative Officer",
    "description": "Organize a filing system for important and confidential company documents. Tourism & Travel NGN 150,000 - 250,000 Negotiable. Update office policies as needed.&hellip;",
    "skills": []
  },
  {
    "job_title": "Technical Specialist",
    "description": "Monitor and optimize system performance and resource usage. Coordinate IT projects, upgrades, and system rollouts. Microsoft 365 Fundamentals (MS-900).&hellip;",
    "skills": []
  },
  {
    "job_title": "Human Resource Officer",
    "description": "Support the development and implementation of HR initiatives and systems. Proven experience as an HR officer, administrator, or other HR position.&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Center Administrator",
    "description": "Provide 24x7 support for critical production systems. Experience working with Oracle Linux operating system. Manage ORACLE, POSTGRESQL and SQL Server databases…&hellip;",
    "skills": [
      "linux",
      "sql"
    ]
  },
  {
    "job_title": "Infrastructure Administrator",
    "description": "Ensure redundancy is completely built into the system to eliminate service failure. University degree in the field of computer science, engineering, or…&hellip;",
    "skills": []
  },
  {
    "job_title": "Modern Workplace Administrator",
    "description": "Documentation: Maintain comprehensive documentation of system configurations, processes, and user guides. Security Compliance: Ensure compliance with security…&hellip;",
    "skills": []
  },
  {
    "job_title": "Operation & Maintenance Technician",
    "description": "Rehlko will provide a reasonable accommodation to associates or applicants with disabilities, in accordance with applicable laws.&hellip;",
    "skills": []
  },
  {
    "job_title": "Controls Coordinator / Administrator II",
    "description": "Provide awareness of Tools in developing oi System 10-1 for system practitioners. Coordinating compliance controls and integrity in the group, ensure…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mid DevOps Engineer",
    "description": "To reliably deploy solutions in the cloud, ensuring a seamless hand-off of code releases between software engineering (Dev) and IT Operations (Ops).&hellip;",
    "skills": []
  },
  {
    "job_title": "Admin",
    "description": "Manufacture of Civilian Armoured Vehicles. Design, Prototyping and Manufacture of Military Vehicles. Turnkey/Engineering, Procurement and Construction contracts…&hellip;",
    "skills": []
  },
  {
    "job_title": "Business Analyst",
    "description": "Knowledge of Windows operating system & networking. Requirements documentation to be used by programmers and DBA to construct system.&hellip;",
    "skills": []
  },
  {
    "job_title": "Laboratory Administrator",
    "description": "Ensure accurate and timely entry of patient information into the laboratory information system (LIS). Proficiency in Microsoft Office Suite (Word, Excel,…&hellip;",
    "skills": []
  },
  {
    "job_title": "SOFTWARE DEVELOPER",
    "description": "The experienced software developer is part of the development team, working on enterprise grade software systems using PHP, JavaEE/.&hellip;",
    "skills": []
  },
  {
    "job_title": "General Manager - IT Infrastructure",
    "description": "Experience supporting AI/ML workloads, IoT platforms, and high-availability systems. Build and manage infrastructure to support scalable digital platforms, IoT…&hellip;",
    "skills": []
  },
  {
    "job_title": "Administrator: Marketing - Support Office Western Cape",
    "description": "Develop and carry out an efficient documentation and filing system. Be the link between Finance and the Marketing Department for the following action areas:&hellip;",
    "skills": []
  },
  {
    "job_title": "HR Officer",
    "description": "Proficient in word processing and HR software and systems. Bachelor's degree in Human Resources, Business Administration, or a related field.&hellip;",
    "skills": []
  },
  {
    "job_title": "Human Resource Generalist",
    "description": "Sufficient understanding of payroll management systems. Maintain effective digital and physical record keeping and filing systems that ensure all staff files…&hellip;",
    "skills": []
  },
  {
    "job_title": "School Onboarding & Growth Representative",
    "description": "Support new schools during their onboarding phase, ensuring proper understanding and smooth adoption of the system.&hellip;",
    "skills": []
  },
  {
    "job_title": "SSHE SPECIALIST 11",
    "description": "Safety, Security, Health, and Environment (SSHE) Specialists not only support one or more safety, security, health, or environmental subject areas for a…&hellip;",
    "skills": []
  },
  {
    "job_title": "Contracts Administrator II",
    "description": "Ensure sound systems are in place by Field Supervisor: Track progress, and support Supervisors with coordinating Contractor’s compliance regarding company…&hellip;",
    "skills": []
  },
  {
    "job_title": "Devops Engineer",
    "description": "System administrators, and QA teams to streamline our operations and improve the overall development lifecycle.. Abeokuta & Ogun State Full Time.&hellip;",
    "skills": []
  },
  {
    "job_title": "Human Resources & Admin Manager",
    "description": "Ensure smooth running of all administrative functions in the office, and oversee sites working with local administrators.&hellip;",
    "skills": []
  },
  {
    "job_title": "Cybersecurity Engineer",
    "description": "Execute security architectures for cloud/hybrid systems. Apply adept understanding and experience with systems automation platforms and technologies.&hellip;",
    "skills": [
      "security",
      "cloud"
    ]
  },
  {
    "job_title": "Fund Accountant",
    "description": "Perform periodic reconciliations of fund positions with custodians, brokers, and fund administrators. Proficiency in financial software and tools (e.g.,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Head of Growth",
    "description": "Champion user feedback from school administrators, teachers, and parents to inform future feature development. Industry:* EdTech / SaaS / School Management.&hellip;",
    "skills": []
  },
  {
    "job_title": "Team Lead, Infrastructure Administrator",
    "description": "Ensure redundancy is completely built into the system to eliminate service failure. University degree in the field of computer science, engineering or…&hellip;",
    "skills": []
  },
  {
    "job_title": "Installation Engineer",
    "description": "A working knowledge of structured cabling systems as the foundation of a system that supports an IP-based AV installation.&hellip;",
    "skills": []
  },
  {
    "job_title": "Admin Supervisor",
    "description": "Knowledge of using an ERP or Human resource management system. The Assistant Administrator reports directly to the Project Administrator, He/She supervises an…&hellip;",
    "skills": []
  },
  {
    "job_title": "Sales Development Representative Poland (all genders)",
    "description": "The position can be performed remotely from Poland or in a hybrid format – full-time or part-time (minimum 30 hours/week).&hellip;",
    "skills": []
  },
  {
    "job_title": "Devops Engineer/Linux Administrator",
    "description": "Design procedures for system troubleshooting and maintenance. Develop software to integrate with internal back-end systems. Deploy product updates and fixes.&hellip;",
    "skills": []
  },
  {
    "job_title": "Technical Support Engineer 2 - MW SCIM",
    "description": "Communicate with end users/system administrators/solution integrators via phone, email, and/or chat to identify, diagnose, and troubleshoot their needs, as well…&hellip;",
    "skills": []
  },
  {
    "job_title": "Edtech Product Support Associate",
    "description": "Collaborate with the education team to develop adoption strategies tailored to differe school systems. Develop and document various use cases for edtech…&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Technical Support & Compliance Officer",
    "description": "Experience with help-desk ticketing systems (Jira, Freshservice, or similar) is an added advantage. You will be the first-line technical contact for staff in…&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Quality Assurance Officer",
    "description": "Work closely with developers, system administrators, and business teams to enhance system reliability. Knowledge of cybersecurity and regulatory compliance in…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer",
    "description": "Troubleshoot, debug, and optimise backend systems and applications. Ensure the technical feasibility of backend features in collaboration with the product team.&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer (Mid to Senior Level) – Remote (Nigeria)",
    "description": "Minimum 5 years of professional backend development experience. Document backend architectures, APIs, and workflows. Self-motivated with strong time management.&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer",
    "description": "API Development: Create RESTful or GraphQL APIs to serve data to frontend apps. Database Management: Design and manage databases using SQL Server, Cosmos DB, or…&hellip;",
    "skills": [
      "apis",
      "sql"
    ]
  },
  {
    "job_title": "Backend Developer",
    "description": "Experience in backend related Azure cloud components such as Web app, Functions is a plus. You will maintain basic developer hygiene that includes but not…&hellip;",
    "skills": [
      "azure",
      "cloud"
    ]
  },
  {
    "job_title": "Backend JavaScript Developer",
    "description": "Work on backend application development using JavaScript and related technologies. Remote (Work From Home) Full Time. Computer Science degree or equivalent.&hellip;",
    "skills": []
  },
  {
    "job_title": "Node.js BackEnd Developer",
    "description": "Integration of user-facing elements developed by front-end developers with server-side logic. We are looking to hire a Node.js developer who will be responsible…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer",
    "description": "3+ years of experience developing scalable backend systems. Integration of user-facing elements developed by front-end developers with server side logic.&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer",
    "description": "Develop and maintain scalable backend systems using queue-based architectures for high-performance applications. Port Harcourt & Rivers State Full Time.&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer",
    "description": "Collaborate with frontend developers and other team members. Design, develop, and maintain backend systems using Django.&hellip;",
    "skills": []
  },
  {
    "job_title": "Front-End Developer",
    "description": "Collaborate with backend developers and UI/UX designers to implement features. Understanding of RESTful APIs and integration with backend services.&hellip;",
    "skills": []
  },
  {
    "job_title": "Back-End Developer",
    "description": "Integrate frontend components with backend services. Troubleshoot, debug, and optimize backend systems. The ideal candidate should have experience with backend…&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Backend Developer (Corper)",
    "description": "You’ll work closely with senior developers, front-end engineers, and product teams to deliver high-quality, scalable, and maintainable code.&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer",
    "description": "Optimize database performance and backend response time. Ability to manage backend infrastructure and troubleshoot issues.&hellip;",
    "skills": []
  },
  {
    "job_title": "Javascript Backend Developer (Node.JS)",
    "description": "Integration of user-facing applications/elements developed by the front-end developer. We are looking for a motivated JavaScript Backend Developer (NodeJS) with…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Backend Developer Python (FastAPI/Flask)",
    "description": "Ownership: Take full responsibility for our backend stack. Python 3.x Expertise: 5+ years of backend development with Python, including writing object-oriented…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile App Developer (Frontend/Backend/Fullstack)",
    "description": "Minimum of 3years+ proven work experience as a Mobile app developer. Solid understanding of REST APIs, Firebase, and backend integration.&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer",
    "description": "Work closely with frontend developers to ensure seamless integration between frontend and backend components. Maintain clear and comprehensive documentation for…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer – Crypto/Coin-Based/Transaction Monitoring & Mobile Communication App (Laravel)",
    "description": "Beyond backend coding, you will contribute to platform stability and business continuity by implementing real-time monitoring, supporting KYC/AML-driven…&hellip;",
    "skills": []
  },
  {
    "job_title": "Swift Developer with Flutter Experience",
    "description": "Work closely with backend developers to integrate APIs and data storage solutions. You can *download PingTop* on the iOS App Store to explore and learn more…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend (PHP) Developer",
    "description": "Responding to integration requests from front-end developers. Minimum of one year of experience in backend web development.&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer - PHP Onsite",
    "description": "Minimum *3 years* of PHP backend development experience. Develop, maintain, and optimize backend systems using PHP and CodeIgniter or similar frameworks.&hellip;",
    "skills": []
  },
  {
    "job_title": "PHP Backend developer (Laravel)",
    "description": "Proficiency in the core features and functionalities of Laravel, including routing, middleware, controllers, requests, and responses.&hellip;",
    "skills": []
  },
  {
    "job_title": "Back-End Developer",
    "description": "Work with other developers, data scientists, system engineers, and other technical experts to develop and implement solutions, primarily working closely with…&hellip;",
    "skills": []
  },
  {
    "job_title": "Next.js Developer (Temporary Contract)",
    "description": "Work closely with backend, design, and DevOps teammates; make rapid, well-reasoned technical decisions and communicate them clearly.&hellip;",
    "skills": []
  },
  {
    "job_title": "Next js Frontend Developer (Typescript, Tailwind and Rest API consumption) Expert",
    "description": "UX Product designers and back-end developers to implement user-friendly interfaces based on provided figma designs and specifications.&hellip;",
    "skills": []
  },
  {
    "job_title": "React Developer (Micro-Frontend Project)",
    "description": "Proven experience integrating REST APIs and working with backend services. Job Position: React Developer (Micro-Frontend Project).&hellip;",
    "skills": [
      "apis",
      "react"
    ]
  },
  {
    "job_title": "Fullstack Web Developer (Next.js) – Remote",
    "description": "Strong fullstack development skills (frontend + backend). Job Type: Part-time / Freelance (with potential to grow into full-time).&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile App Developer (Mid to Senior Level) – Remote (Nigeria)",
    "description": "Integrate mobile apps with backend services and APIs securely and efficiently. You will collaborate with design and backend teams to deliver seamless user…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "You will work on both frontend and backend systems, ensuring seamless integration and high performance. We seek skilled Full Stack Developers proficient in C#…&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend Developer",
    "description": "Working with backend developers to integrate frontend components with APIs. As a Frontend Developer, you'll be instrumental in creating the interactive and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Engineer",
    "description": "Work alongside front-end developers to produce efficient and user-friendly systems. Minimum of 4 years of professional experience in the following backend…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Full Stack Developer",
    "description": "Collaborate with cross-functional teams including developers, product managers, and DevOps engineers. We’re seeking a Senior Fullstack Developer with strong…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Backend Developer (.Net)",
    "description": "The Senior Backend Developer will be responsible for building scalable RESTful APIs, the server-side application logic integration with both internal and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend developers",
    "description": "Collaborate with our front-end developers to integrate the back end and front end of our applications. Type of Job: On-site (full-time).&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Backend Developer - .NET/C#",
    "description": "Experience developing scalable, high-performance backend systems. Extensive experience with C# 10+ and ASP. Strong understanding of domain-driven design (DDD)…&hellip;",
    "skills": []
  },
  {
    "job_title": "Dart/Flutter Developer",
    "description": "Collaborate with product managers, designers, and backend developers to deliver cohesive and robust applications. Strong communication and interpersonal skills.&hellip;",
    "skills": []
  },
  {
    "job_title": "MOBILE DEVELOPER",
    "description": "You will work closely with product managers, designers, and backend developers to deliver intuitive, scalable, and secure mobile solutions that enhance user…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "*Performance Optimization:* Identify and resolve frontend/backend bottlenecks to ensure optimal application speed, performance and scalability.&hellip;",
    "skills": []
  },
  {
    "job_title": "Python Developer",
    "description": "Design, implement, and deploy robust and scalable backend services using Python frameworks (e.g., Django, Flask, FastAPI).&hellip;",
    "skills": [
      "python",
      "flask",
      "django"
    ]
  },
  {
    "job_title": "React Native Developer",
    "description": "You will be responsible for developing and maintaining high-performance apps for Android and iOS, collaborating with designers, backend developers, and product…&hellip;",
    "skills": []
  },
  {
    "job_title": "AI/ML Backend Developer (Blockchain-Focused)",
    "description": "Build scalable backend systems and APIs that integrate AI capabilities. Strong backend development skills using FastAPI, Flask, or Django.&hellip;",
    "skills": [
      "apis",
      "flask"
    ]
  },
  {
    "job_title": "Software Developer",
    "description": "We are seeking to hire an experienced software developer proficient in full stack development with main focus on backend. Experience with React Native/Expo.&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend Developer",
    "description": "Work closely with designers and backend developers to ensure seamless integration of UI components. Banking, Finance & Insurance NGN 250,000 - 400,000.&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile Developer",
    "description": "Work closely with product owners, UI/UX designers, and backend developers to translate requirements into functional, high-performance apps.&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer Tutor",
    "description": "We Seek a full-stack developer tutor to teach and train young students in full-stack development part-time, 4 days per week. Remote (Work From Home) Part Time.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Full-Stack Developer",
    "description": "Mentor and guide junior and mid-level developers. Strong proficiency with Node.js and modern backend frameworks (e.g., Express, NestJS).&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile App Developer",
    "description": "Collaborate with UI/UX designers, product managers, and backend developers. Remote (Work From Home) Contract. Optimize applications for performance, scalability…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "Mentor junior developers and contribute to technical strategy. Architect backend services using *C# and ASP. Build dynamic and responsive frontends using *React…&hellip;",
    "skills": []
  },
  {
    "job_title": "Quality Assurance Engineer",
    "description": "Collaborate closely with developers, product managers, data scientist and designers to understand requirements and define quality standards.&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer (MERN)",
    "description": "Build robust backend services and REST APIs with *Node.js* and *Express.js*. You will be responsible for developing and maintaining high-performance web…&hellip;",
    "skills": []
  },
  {
    "job_title": "App Developer",
    "description": "Knowledge of backend technologies and web services (e.g., RESTful APIs, JSON, XML) is a plus. The App Developer will be responsible for designing, developing,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Frontend Developer (Lagos, Nigeria)",
    "description": "Optimize data flow between the frontend and backend systems to ensure seamless user experiences. Collaborate with backend teams to define and integrate RESTful…&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Mobile App Developer/Intern",
    "description": "Collaborate with designers and backend developers to implement user-friendly features. Equipment and software tools will be provided by the developer/Instant…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "Perform both frontend and backend. Ibadan & Oyo State Full Time. Build and maintain web applications with a focus on seamless front-end and back-end integration…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "We are currently looking for a full-time web developer, who can hit the ground running; to join the Doctoora team in improving our platform and adding new…&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer",
    "description": "You will work closely with designers, product managers, and backend developers to deliver scalable and secure digital solutions.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Frontend Deveoper",
    "description": "Collaborate with designers and backend developers to implement scalable frontend solutions. Participate in code reviews and mentor junior developers if needed.&hellip;",
    "skills": []
  },
  {
    "job_title": "Bubble Low-code Developer 2",
    "description": "Excellent collaboration skills with both UI/UX designers, backend developers, project managers and responds positively to constructive feedback.&hellip;",
    "skills": []
  },
  {
    "job_title": "ANDROID DEVELOPER",
    "description": "Integration: Experience with cloud services and backend integration, such as AWS or Firebase. The ideal candidate will have a strong background in Android SDK,…&hellip;",
    "skills": [
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "Front-end Developer (Flutter)",
    "description": "Excellent communication skills to collaborate with designers, backend developers, and stakeholders. Familiarity with RESTful APIs and/or GraphQL for backend…&hellip;",
    "skills": []
  },
  {
    "job_title": "Trainee Technical Product Owner at Startup",
    "description": "Proven track record in product ownership or business analyst roles. Keep in mind we will be using internal database tools and will not be using third party…&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Data Analyst",
    "description": "Assist in field data collection and school-level research. 1–2 years of experience in data analysis or research support. Job Position: Junior Data Analyst.&hellip;",
    "skills": []
  },
  {
    "job_title": "DATA ANALYST",
    "description": "3 years work experience as a data analyst or in a related field. Collect, clean, and preprocess data from multiple sources to ensure data accuracy and integrity…&hellip;",
    "skills": []
  },
  {
    "job_title": "National Individual Consultant: Data Analyst, Abuja, Nigeria - NOB",
    "description": "Facilitate training sessions for data collectors, with a focus on digital data entry, quality assurance procedures, and troubleshooting during fieldwork.&hellip;",
    "skills": []
  },
  {
    "job_title": "BI / Data Analyst (Mid to Senior Level) – Remote (Nigeria)",
    "description": "Minimum 5 years of experience as a BI analyst, data analyst, or similar role. Ensure data accuracy, consistency, and compliance with data governance standards.&hellip;",
    "skills": []
  },
  {
    "job_title": "Excel Data Analyst",
    "description": "Qualification:A degree in data science, computer science, statistics, mathematics, economics or other relevant field is required.&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Analyst",
    "description": "Ensure data accuracy and integrity by performing regular data quality checks. Identify opportunities for process improvements using data analysis.&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Analyst",
    "description": "Developing and implementing data strategies (databases, data collection system, data analytics etc.) that provide statistical efficiency.&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Analyst, Reconciliation & Payments | Lagos, Nigeria",
    "description": "Experience with Python for exploratory data analysis and automation. As a Data Analyst for Reconciliation & Payments, you will support Moove’s operations by…&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Analyst",
    "description": "Experience in data analysis and data mining. Our client is seeking a skilled Data Analyst to support business decision-making through data-driven insights and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Analyst",
    "description": "3 – 5 years of experience in a data analyst or BI analyst role (experience in fintech is a plus). Automate reporting and data processes to improve team…&hellip;",
    "skills": []
  },
  {
    "job_title": "Database Administrator/ Data Analyst",
    "description": "Experience with ETL processes and data warehousing is a plus. Identify trends, anomalies, and actionable opportunities in data. Job Types: Full-time, Permanent.&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Analyst",
    "description": "Present data findings to management in clear, concise formats. Excellent communication skills – able to translate data into understandable insights.&hellip;",
    "skills": []
  },
  {
    "job_title": "BI / Data Analyst (Mid to Senior Level)",
    "description": "Support data governance efforts by helping define metadata, data lineage, and access policies across shared datasets. Data Engineering: 4 years (Preferred).&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Analyst",
    "description": "The candidates would be responsible for designing and maintaining data systems, preparing reports, and collaborating with stakeholders to define business needs.&hellip;",
    "skills": []
  },
  {
    "job_title": "National Individual Consultant: Data Analyst",
    "description": "Facilitate training sessions for data collectors, with a focus on digital data entry, quality assurance procedures, and troubleshooting during fieldwork.&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Analyst",
    "description": "Manage the secure transfer of customer data using *SFTP (Secure File Transfer Protocol)*, ensuring data confidentiality and integrity during transmission.&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Analyst",
    "description": "Develop reports, presentations, and dashboards to provide data-driven insights. Strong analytical and research skills with the ability to interpret data and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Analyst II",
    "description": "Focused on improving data quality. Report generation and data analysis. Responsible for importing, cleansing, validating and analyzing data with the purpose of…&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Analyst",
    "description": "Strong analytical skills with the ability to interpret complex data, identify patterns, and draw actionable insights.&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Analyst",
    "description": "This role requires a strong grasp of data interpretation, report generation, and visualization techniques relevant to pharmaceutical operations.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Data Analyst",
    "description": "Good technical knowledge of business intelligence, data quality, data assurance. Technical expertise regarding data models, database design development, data…&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Analyst Facilitator",
    "description": "Good knowledge of Python for analytics & analytics, including data manipulation, statistical analysis, data visualization, and machine learning.&hellip;",
    "skills": []
  },
  {
    "job_title": "Supply Chain Analyst - Mowe",
    "description": "Analyze data using dashboards and Excel to optimize supply chain performance. Proficiency in Excel, data analysis, and dashboard management.&hellip;",
    "skills": [
      "excel",
      "data analysis"
    ]
  },
  {
    "job_title": "Data Analyst",
    "description": "Analyze learning data and feedback to improve course outcomes. Help learners solve real problems using data, both during sessions and through project feedback.&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Analyst",
    "description": "Collaborate with data engineering teams to enhance the data infrastructure supporting Kuda for Business. Ensure seamless integration of internal and external…&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Analyst / Statistics Officer",
    "description": "Develop mathematical or statistical models to analyze data. Use data analysis to support and improve business decisions. Age must be between 22 - 28 years.&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Support Analyst I",
    "description": "Primary customer point of contact for ALL questions related to “Data”: data troubleshooting, configuration management support, data heath check monitoring and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Financial Analyst Intern (Nigeria-Remote)",
    "description": "You will spend your day analyzing huge amounts of financial data and preparing various accounting and financial reports.&hellip;",
    "skills": []
  },
  {
    "job_title": "Business Analyst Internship",
    "description": "Analyze and interpret data to identify trends and support decision-making. This internship offers hands-on experience in business process analysis, data-driven…&hellip;",
    "skills": []
  },
  {
    "job_title": "QUALITY ASSURANCE ANALYST (SAGAMU,OGUN STATE)",
    "description": "✅ Maintain accurate records of quality checks, reports, and production data. Our client, a leading *Plastic Manufacturing* company, is seeking a detail-oriented…&hellip;",
    "skills": []
  },
  {
    "job_title": "Dealer Manager / Data Analyst",
    "description": "Support dealer management by aligning sales data with performance goals and market expectations. This dual-function role blends data analysis with dealer…&hellip;",
    "skills": []
  },
  {
    "job_title": "Investment Analyst",
    "description": "Strong analytical skills and attention to detail, with the ability to interpret complex financial data and draw meaningful insights.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Data & Business Analyst",
    "description": "Ensuring data accuracy and that heavy business priorities can be based on the insights from our reports. You've held sole responsibility for core data sources…&hellip;",
    "skills": []
  },
  {
    "job_title": "Logistics Analyst",
    "description": "Strong data entry and administrative skills (preferred). Minimum of 2-4 years of experience as a logistics analyst in the IT industry or related fields.&hellip;",
    "skills": []
  },
  {
    "job_title": "Laboratory Analyst",
    "description": "High attention to detail and accuracy in data recording and interpretation. Proficiency in using laboratory equipment and computer software for data entry and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Associate Manager, Data/GIS Analyst",
    "description": "Demonstrated Knowledge of GIS data principles, practices and Techniques, Cartography and data collection systems. Public Health Emergency Management Systems.&hellip;",
    "skills": []
  },
  {
    "job_title": "Business Analyst",
    "description": "Support data-driven decision-making within the organization. Help analyze data to identify trends, patterns, and insights that inform business decisions.&hellip;",
    "skills": []
  },
  {
    "job_title": "Business Analyst",
    "description": "Translate data and insights into clear business recommendations and actionable plans. Translate complex data and research findings into clear recommendations…&hellip;",
    "skills": []
  },
  {
    "job_title": "Business Analyst",
    "description": "Perform data discovery, analysis and modeling. Gather and analyze data for potential business expansion. Identify specific business opportunities and ways to…&hellip;",
    "skills": []
  },
  {
    "job_title": "Quality Assurance Analyst",
    "description": "Facilitate proactive solutions by collecting and analyzing quality data. An excellent numerical skills and understanding of data analysis/statistical methods.&hellip;",
    "skills": []
  },
  {
    "job_title": "Stategy & Research Analyst",
    "description": "Develop strategic recommendations based on data-driven insights. 3+ years of Experience with data analysis and market research tools.&hellip;",
    "skills": []
  },
  {
    "job_title": "Research Analyst",
    "description": "Support strategy teams with data-driven insights to guide investment decisions and business planning. Experience with Bloomberg, Reuters, or other market data…&hellip;",
    "skills": []
  },
  {
    "job_title": "Associate Business Analyst",
    "description": "Understanding of data analysis and reporting tools. The Junior Business Analyst plays a critical role in bridging the gap between business needs and software…&hellip;",
    "skills": []
  },
  {
    "job_title": "Supply Chain Analyst",
    "description": "Analyze data using dashboards and Excel to optimize supply chain performance. Proficiency in Excel, data analysis, and dashboard management.&hellip;",
    "skills": [
      "excel",
      "data analysis"
    ]
  },
  {
    "job_title": "Private Data Analytics / Data Science Tutor (Remote)",
    "description": "Practical data engineering and big data tools. Stay updated with industry trends, best practices, and tools used by data analysts, scientists, and engineers.&hellip;",
    "skills": []
  },
  {
    "job_title": "Financial Analyst",
    "description": "Strong analytical and data gathering skills. Analyze financial data – and create financial models for decision support.&hellip;",
    "skills": []
  },
  {
    "job_title": "Retail Sales Analyst",
    "description": "Strong analytical skills with proficiency in data analysis tools and techniques . Analyse retail sales data to identify trends, patterns, and opportunities for…&hellip;",
    "skills": []
  },
  {
    "job_title": "Quality Assurance Analyst",
    "description": "We also make business decisions based on the large stream of data we receive daily, so we work daily with big data, perform data analytics, and build models to…&hellip;",
    "skills": []
  },
  {
    "job_title": "Cybersecurity Analyst",
    "description": "Advise clients on compliance with data protection and sector-specific regulations such as NDPR, HIPAA, and international standards. Degree in a related field.&hellip;",
    "skills": []
  },
  {
    "job_title": "Data Analytics Officer",
    "description": "To ensure data accuracy in report generation and data upload. Responsible for overseeing the development and use of data systems by identifying and developing…&hellip;",
    "skills": []
  },
  {
    "job_title": "AI/ML Engineer",
    "description": "*Data Engineering*: Work with structured and unstructured datasets, clean and preprocess data, and create data pipelines for model training and deployment.&hellip;",
    "skills": []
  },
  {
    "job_title": "Payroll Analyst - Time and Attendance",
    "description": "Analytical Skills: Strong analytical and problem-solving skills, with the ability to interpret data and identify trends.&hellip;",
    "skills": []
  },
  {
    "job_title": "Public Health Analyst (Public Health Degree required)",
    "description": "Support and conduct data analysis. This will involve some literature review, data analysis, and data collection through interviews and other methods.&hellip;",
    "skills": []
  },
  {
    "job_title": "Finance Analyst",
    "description": "Ability to interpret and analyze complex financial data. Analyze financial data to identify trends, variances, and opportunities for improvement.&hellip;",
    "skills": []
  },
  {
    "job_title": "Exports Analyst (Port Harcourt)",
    "description": "Prepare market reports/dashboard by collecting populating & analyzing data from various sources. He shall also be supporting marketing activities in West Africa…&hellip;",
    "skills": []
  },
  {
    "job_title": "Analyst, Business, Stanbic IBTC Pension Managers",
    "description": "To facilitate and manage feature development and implementation as well as business team usage of Enterprise Solutions such as Salesforce and Robotic Process…&hellip;",
    "skills": []
  },
  {
    "job_title": "Document Control Analyst",
    "description": "A highly organized and detail-oriented professional with extensive experience in document control/data analysis.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Coordinator Data Analyst",
    "description": "Demonstrated leadership abilities, with prior experience mentoring or leading a team of data analysts. Demonstrated Knowledge of GIS data principles, practices…&hellip;",
    "skills": []
  },
  {
    "job_title": "Tax Analyst Intern",
    "description": "Analyze financial data and provide insights on tax liabilities. The tax intern will support the tax team in various tax-related functions, including tax…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Design / Unity Engineer (Unity 3D Developer)",
    "description": "Design and develop immersive 3D software applications using Unity for industrial simulations, virtual commissioning, and digital twin environments.&hellip;",
    "skills": []
  },
  {
    "job_title": "Front-End Javascript Developer",
    "description": "Please summarise any industry experiences you have as a developer, not necessarily Javascript, that would be useful or particularly relevant to this role?&hellip;",
    "skills": []
  },
  {
    "job_title": "DevOps (Systems Administrator) Engineer",
    "description": "We need thinkers who can reimagine how software should be built. We want to hire an unusual set of high-performance people with deep skills in various domains…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Developer",
    "description": "Integrate software components and third-party programs. Troubleshoot, debug, and upgrade existing software. The Software Developer will ensure the availability…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Developer",
    "description": "Design, implement, document, and test software solutions. Play a major role in developing new software for one or more of our critical product lines.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Developer (Intern)",
    "description": "As a software developer (Intern), you will be accepted into the Byteworks Software Developer Onboarding programme, where you would learn the habits of…&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Software Developer",
    "description": "Collaborate with Team: Work in an agile environment alongside lead developer, trainee developer, and other team members to deliver new product and improvements.&hellip;",
    "skills": []
  },
  {
    "job_title": "SOFTWARE DEVELOPER",
    "description": "The experienced software developer is part of the development team, working on enterprise grade software systems using PHP, JavaEE/.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Developer",
    "description": "Equipment and software tools will be provided by the developer/Instant Health Services. Strong understanding of the software development life cycle (SDLC).&hellip;",
    "skills": []
  },
  {
    "job_title": "Python Developer",
    "description": "Assist in developing and testing software applications and systems. Remote (Work From Home) Internship & Graduate. IT & Telecoms NGN 75,000 - 150,000.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Developer",
    "description": "Compiling and assessing user feedback to improve software performance. Developing technical documentation to guide future software development projects.&hellip;",
    "skills": []
  },
  {
    "job_title": "Developer",
    "description": "Proven experience in software development, with knowledge of programming languages such as C#, Java, or JavaScript.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Developer",
    "description": "We are seeking to hire an experienced software developer proficient in full stack development with main focus on backend. Experience with React Native/Expo.&hellip;",
    "skills": []
  },
  {
    "job_title": "Flutter Developer",
    "description": "Remote (Work From Home) Full Time. Develop and maintain cross-platform mobile applications using Flutter. Collaborate with UI/UX designers to implement designs…&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer",
    "description": "Minimum of 1 year of proven work experience as a web developer. Remote (Work From Home) Full Time. The ideal candidate will be capable of building websites and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graduate Software Developer - Trainee",
    "description": "*Collaboration:* Work closely with Lead developer and the wider development team to design, build, and test software solutions. Basic knowledge of C# and .&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Developer",
    "description": "Work with developers to design algorithms and flowcharts. Troubleshoot, debug, and upgrade existing software. Possess 1-2 years Experience with software design…&hellip;",
    "skills": []
  },
  {
    "job_title": "FULL STACK SOFTWARE DEVELOPER",
    "description": "Quality Assurance: Solid understanding of QA methodologies, skilled in both Automated and Manual Testing to ensure software quality.&hellip;",
    "skills": []
  },
  {
    "job_title": "IT/Client Support Officer",
    "description": "Diagnose and troubleshoot software and system issues. Solid understanding of software systems and basic troubleshooting methodologies.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Developer, E-Estates",
    "description": "Fixing and improving existing software. Troubleshoot, debug and upgrade existing software. Work with developers to design algorithms and flowcharts.&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend Developer",
    "description": "Collaborate with back-end developers and web designers to improve usability. Abeokuta & Ogun State Full Time. Proven work experience as a Front-End Developer or…&hellip;",
    "skills": []
  },
  {
    "job_title": "React Developer (Micro-Frontend Project)",
    "description": "Job Position: React Developer (Micro-Frontend Project). The role is ideal for someone who is experienced with React, adaptable to new frameworks, and committed…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "Foster good software development best practices. Experience using software testing libraries and frameworks. *Microservices Architecture:* Experience designing…&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend Developer",
    "description": "You’ll be working on a modern codebase built with React, Next.js, and TypeScript, contributing to both UI implementation and writing robust test coverage using…&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend Developer",
    "description": "Working with backend developers to integrate frontend components with APIs. As a Frontend Developer, you'll be instrumental in creating the interactive and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Front-End Developer",
    "description": "This role bridges the creative and technical aspects of project delivery- you must design and implement the user interface and engineer the experience of every…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer Tutor",
    "description": "Familiarity with Agile methodologies, version control (Git), and software development lifecycles. We Seek a full-stack developer tutor to teach and train young…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Developer",
    "description": "Must have At least 5 years of experience as a java and alternative software service developer. Drive company's vision by ensuring the availability, protection…&hellip;",
    "skills": []
  },
  {
    "job_title": "C# Developer",
    "description": "Remote (Work From Home) Contract. IT & Telecoms NGN 150,000 - 250,000 Negotiable. NET MAUI Developer to build cross-platform mobile and desktop apps using C#…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mid C# Developer",
    "description": "Collaborate with cross-functional teams, including software architects, frontend developers, and project managers, to deliver cutting-edge solutions.&hellip;",
    "skills": []
  },
  {
    "job_title": "Node.js BackEnd Developer",
    "description": "Integration of user-facing elements developed by front-end developers with server-side logic. We are looking to hire a Node.js developer who will be responsible…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend JavaScript Developer",
    "description": "Remote (Work From Home) Full Time. You will be responsible for building and designing highly scalable services and RESTful APIs.&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Software Developer",
    "description": "*Experience:* 2+ years in large-scale software development. We are seeking a skilled Full Stack Developer to design, develop, and maintain high-performance,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer (Mid to Senior Level) – Remote (Nigeria)",
    "description": "Collaborate with frontend developers, DevOps, and product teams to deliver integrated solutions. Alpha Global is seeking a talented Backend Developer to design,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Software Developer",
    "description": "This is a full-time on-site role for a Frontend and Backend Developer. The MENN and MERN Stack skill set will be required (MongoDB, Express Js, Next Js, React…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer",
    "description": "3+ years of professional software development real-world experience to develop scalable & high-quality software.&hellip;",
    "skills": []
  },
  {
    "job_title": "PHP Developer",
    "description": "Integration of user-facing elements developed by front-end developers. We are looking for a PHP Developer responsible for managing back-end services and the…&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend Developer",
    "description": "Work closely with designers and backend developers to ensure seamless integration of UI components. Banking, Finance & Insurance NGN 250,000 - 400,000.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Developer (PHP)",
    "description": "We’re seeking a PHP Developer to join our team and contribute to the development, testing, and maintenance of high-quality applications using Laravel and Lumen.&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer",
    "description": "Solid understanding of object-oriented programming and software design patterns. Collaborate with front-end developers, designers, and other stakeholders to…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Developers",
    "description": "For *Frontend Developers*, required language *React*. For *Backend Developers*, required language *Laravel.*. For *Fullstack Developers*, required language *PHP…&hellip;",
    "skills": [
      "react",
      "php"
    ]
  },
  {
    "job_title": "UI Designer",
    "description": "Work closely with front-end developers to implement your designs using HTML and CSS. Remote (Work From Home) Full Time. Ensure the feasibility of UI/UX designs.&hellip;",
    "skills": [
      "css",
      "html"
    ]
  },
  {
    "job_title": "SOFTWARE DEVELOPER (Java)",
    "description": "2+ years of software development experience. Proficiency in the use of modern tools and technologies that help with the software development lifecycle.&hellip;",
    "skills": []
  },
  {
    "job_title": "Back-End Developer",
    "description": "Work with other developers, data scientists, system engineers, and other technical experts to develop and implement solutions, primarily working closely with…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "You will collaborate with the Development & Operations Team to deliver high-quality software solutions and report to the Devops Lead.&hellip;",
    "skills": []
  },
  {
    "job_title": "Java Enterprise (Web) Software Developer",
    "description": "Maintains records of software licences. Implements disaster recovery and software support. A periodic check for computer software-related issues.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Developer (Full Stack)",
    "description": "Knowledge of software development best practices and emerging trends. 4 - 6 years of experience as a full-stack developer.&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile App Developer",
    "description": "Remote (Work From Home) Full Time. The ideal candidate will be able to build mobile apps for both Android and IOS platforms.&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Mobile App Developer/Intern",
    "description": "Equipment and software tools will be provided by the developer/Instant Health Services. Collaborate with designers and backend developers to implement user-…&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer",
    "description": "Are you passionate about developing state-of-the-art HTML5 mobile apps? Do you have an eye for good design and a feel for innovative user interfaces? Join our…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer",
    "description": "You'll collaborate closely with our product and tech teams to deliver a seamless experience to thousands of daily users.&hellip;",
    "skills": []
  },
  {
    "job_title": "ASP.NET Developer",
    "description": "Design, develop, and test robust and scalable software. Collaborate with team to gather and analyze business requirements.&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "Managing the complete software development process from conception to deployment. Managing the end-end life cycle for the production of software and application…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Full Stack Developer",
    "description": "Build and maintain CI/CD pipelines, ensuring efficient and secure software delivery. Collaborate with cross-functional teams including developers, product…&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Designer",
    "description": "Collaborate closely with developers to implement designs accurately. Your designs will guide our developers and elevate our digital products to world-class…&hellip;",
    "skills": []
  },
  {
    "job_title": "FULL STACK DEVELOPER",
    "description": "Full stack developers will be required to see out a project from conception to final product, requiring good organizational skills and attention to detail.&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer",
    "description": "Website and software application designing, building, or maintaining. We are looking for a skilled web developer who will be responsible for developing and/or…&hellip;",
    "skills": []
  },
  {
    "job_title": "Python Trainee Developer (Internship)",
    "description": "Following an initial intense training programme, successful candidates will be assigned to our various project teams to assist in the conception, development…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Software Developer (Java)",
    "description": "2+ years of software development experience. Proficiency in the use of modern tools and technologies that help with the software development lifecycle.&hellip;",
    "skills": []
  },
  {
    "job_title": "Front-End Developer",
    "description": "You’ll collaborate with designers and developers to build user interfaces for our web applications. Collaborate with designers and back-end developers to…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mid C# Developer",
    "description": "Collaborate with cross-functional teams, including software architects, frontend developers, and project managers, to deliver cutting-edge solutions.&hellip;",
    "skills": []
  },
  {
    "job_title": "Front-End Developer",
    "description": "You’ll collaborate with designers and developers to build user interfaces for our web applications. Collaborate with designers and back-end developers to…&hellip;",
    "skills": []
  },
  {
    "job_title": "DevOps (Systems Administrator) Engineer",
    "description": "Implement and manage a cloud native host service independent of popular cloud service providers and also be able to deploy our application on Azure, AWS, GCloud…&hellip;",
    "skills": [
      "azure",
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "SDET – Software QA Automation",
    "description": "Collaborate closely with product managers, engineers, and designers to identify acceptance criteria and define test coverage.&hellip;",
    "skills": []
  },
  {
    "job_title": "Infrastructure / Cloud / DevOps Engineer (Junior Associate)",
    "description": "Managing organisational and client Infrastructure including but not limited to Amazon Web Services (AWS) , Google Cloud (GCP) , Azure , Digital Ocean, Hostgator…&hellip;",
    "skills": [
      "azure",
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "AI/ML Engineer",
    "description": "Solid understanding of cloud-based AI platforms, particularly OCI (Oracle Cloud Infrastructure). Employment Type:* 6–12-month Contract (Full-Time) /possibility…&hellip;",
    "skills": []
  },
  {
    "job_title": "Cloud Infrastructure Engineer",
    "description": "Expertise with both on-premises and cloud environments. Experience: 3+ years' experience as a cloud administrator.&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior DevOps Engineer",
    "description": "Exposure to AWS, Azure, or GCP cloud environments. Help manage and monitor cloud and on-premise resources. Basic experience with cloud services (AWS, Azure, or…&hellip;",
    "skills": [
      "azure",
      "aws",
      "cloud"
    ]
  },
  {
    "job_title": "Cybersecurity Engineer",
    "description": "Familiarity with cloud security controls and identity & access management (IAM). Secure cloud environments (AWS, Azure, GCP) and DevOps pipelines.&hellip;",
    "skills": [
      "security",
      "cloud",
      "azure",
      "aws"
    ]
  },
  {
    "job_title": "AI Engineer",
    "description": "Collaborate with data scientists, engineers, and product teams to identify opportunities for AI-driven solutions. Strong communication and collaboration skills.&hellip;",
    "skills": []
  },
  {
    "job_title": "Head, Cloud Engineer",
    "description": "Orchestrating and automating cloud-based platforms throughout the company. Manage the planning, design, and development of cloud solutions.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "Deploy apps on the cloud and implement CI/CD workflows to automate build, test and deployment processes (linking to GitHub or other code versioning software).&hellip;",
    "skills": []
  },
  {
    "job_title": "Quality Assurance Engineer",
    "description": "Experience with CI/CD pipelines and cloud-based testing platforms. You’ll design and implement scalable, automated testing systems and perform thorough…&hellip;",
    "skills": []
  },
  {
    "job_title": "Cloud Network Engineer",
    "description": "Understanding of cloud and on-premises load balancing and DNS management. Configure and maintain AWS security groups, NACLs, and route tables to ensure secure…&hellip;",
    "skills": [
      "security",
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "Mid DevOps Engineer",
    "description": "Setup of infrastructure and resources required to host software services as a series of cloud native applications and services hosted within a cloud agnostic…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Azure Cloud Engineer",
    "description": "Ensure compliance with cloud governance and security policies. Design and implement secure, scalable, and resilient Azure cloud infrastructure.&hellip;",
    "skills": [
      "security",
      "cloud",
      "azure"
    ]
  },
  {
    "job_title": "Site Reliability Engineer",
    "description": "Strong knowledge of cloud infrastructure, Kubernetes, and container orchestration tools. Moniepoint processed $182 billion in 2023, and currently processes the…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mid-level DevOps Engineer",
    "description": "Experience with Kubernetes in production environments. Working knowledge of Continuous Integration (CI/CD) tools like Jenkins.&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Engineer",
    "description": "Familiarity with cloud platforms (AWS, Azure, or Google Cloud). You’ll collaborate closely with frontend engineers, product managers, and designers to deliver…&hellip;",
    "skills": [
      "azure",
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "Cybersecurity Engineer",
    "description": "∙ Collaborate with IT teams to ensure security controls are properly integrated into new and existing systems, including cloud environments.&hellip;",
    "skills": [
      "security",
      "cloud"
    ]
  },
  {
    "job_title": "Systems Engineer Trainee (Internship)",
    "description": "This is a short term internship ( 6 months – 1 year contract) position. Suitable for industrial attachment (minimum 6 months), NYSC and Fresh Graduates.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Frontend Engineer",
    "description": "Mentor junior engineers and promote knowledge-sharing within the team. Familiarity with cloud platforms (*CCP*, AWS, GCP) and CI/CD pipelines.&hellip;",
    "skills": [
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "Devops Engineer",
    "description": "Maintain and optimize cloud infrastructure (AWS, Azure, or GCP). We are seeking a proactive and experienced DevOps Engineer to manage and enhance our cloud…&hellip;",
    "skills": [
      "azure",
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "DevOps Engineer",
    "description": "Document processes and mentor junior engineers. Optimise cloud costs while ensuring high performance. Design, deploy, and manage secure, scalable cloud…&hellip;",
    "skills": []
  },
  {
    "job_title": "NETWORK ENGINEER",
    "description": "Experience with cloud networking (AWS, Azure, GCP). Work closely with systems engineers, helpdesk staff, and other teams to ensure seamless IT operations.&hellip;",
    "skills": [
      "azure",
      "cloud",
      "aws",
      "networking"
    ]
  },
  {
    "job_title": "Software Engineer",
    "description": "Background in DevOps, cloud infrastructure (AWS, GCP), or serverless architecture. The ideal candidate is a *well-rounded engineer* who thrives on solving…&hellip;",
    "skills": [
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "Cloud Solutions Architect (Senior Level) – Remote (Nigeria)",
    "description": "Provide mentorship to junior architects and cloud engineers. Lead multi-cloud migrations, hybrid cloud setups, and enterprise cloud governance frameworks.&hellip;",
    "skills": []
  },
  {
    "job_title": "Middle DevOps",
    "description": "Provide specialised advice and support to team members and developers around cloud infrastructure and container/K8s best practise.&hellip;",
    "skills": []
  },
  {
    "job_title": "Information System Engineer",
    "description": "\\*\\*FULL TIME ONLY, NO PART-TIMERS/FREELANCERS/ STUDENTS\\*\\**. At least 6 years of work experience as a Systems Engineer with strong expertise in the following…&hellip;",
    "skills": []
  },
  {
    "job_title": "Cybersecurity Engineer",
    "description": "Employ cloud-based APIs when suitable to write network/system-level tools for safeguarding cloud environments. Respond to security incident escalations.&hellip;",
    "skills": [
      "apis",
      "security",
      "cloud"
    ]
  },
  {
    "job_title": "DevOps Engineer",
    "description": "Ensure scalability, reliability, and security of cloud-based infrastructure. Proven experience in deploying and managing CI/CD pipelines and cloud…&hellip;",
    "skills": [
      "security",
      "cloud"
    ]
  },
  {
    "job_title": "Microsoft Azure Engineer",
    "description": "We are seeking an experienced and passionate azure cloud engineer to join our company. Migrate existing infrastructure services to cloud-based solutions.&hellip;",
    "skills": [
      "azure",
      "cloud"
    ]
  },
  {
    "job_title": "Network Cloud Engineer",
    "description": "Manage cloud-based infrastructure on AWS, including EC2 Linux/Windows instances, Images, snapshot backups, Software Defined Network and defining Security…&hellip;",
    "skills": [
      "linux",
      "security",
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "DevOps Engineer",
    "description": "Experience with automating cloud native technologies, deploying applications, and provisioning infrastructure. Net, C++ or similar object-oriented language.&hellip;",
    "skills": [
      "cloud",
      "c++"
    ]
  },
  {
    "job_title": "IT Infrastructure/ DevOps / Systems Engineer Trainee (June 2025)",
    "description": "This is a short term internship ( 6 months – 1 year contract) position. Suitable for industrial attachment (minimum 6 months), NYSC and Fresh Graduates.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior DevOps Engineer",
    "description": "Proven track record in architecting multi-cloud infrastructure (AWS, Azure, GCP) with zero-trust security principles and hybrid cloud/colocation strategies.&hellip;",
    "skills": [
      "azure",
      "security",
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "AI / Machine Learning Engineer (Senior Level) – Remote (Nigeria)",
    "description": "Collaborate with data engineers to preprocess and prepare large datasets for model training. Candidates should have at least 5 years of experience in machine…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer",
    "description": "Best in class cloud technology & micro-services architecture. Experience in backend related Azure cloud components such as Web app, Functions is a plus.&hellip;",
    "skills": [
      "azure",
      "cloud"
    ]
  },
  {
    "job_title": "IP Core Network Engineer",
    "description": "Understanding of cloud networking principles and architectures (AWS, Azure, GCP). Our client is a facilities-based telecommunications services provider who has…&hellip;",
    "skills": [
      "azure",
      "cloud",
      "aws",
      "networking"
    ]
  },
  {
    "job_title": "SERVICE DELIVERY MANAGER",
    "description": "The role also includes leading the customer network support engineers’ team and working closely with the competence centers, global support, and product line…&hellip;",
    "skills": []
  },
  {
    "job_title": "General Manager - IT Infrastructure",
    "description": "Lead and develop a high-performance team of IT engineers, administrators, and support staff. Strong knowledge of cloud platforms (Azure, AWS), hybrid IT…&hellip;",
    "skills": [
      "azure",
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "Python Engineer (AI/ML) Level I-II",
    "description": "Through world-class consultation, innovative IT solutions and personalized client services, Cavista increases operational efficiency for organizations of all…&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Engineer",
    "description": "Escalate complex issues to senior engineers or vendors when necessary, ensuring timely resolution. Troubleshoot hardware, software, networking, and cloud…&hellip;",
    "skills": [
      "cloud",
      "networking"
    ]
  },
  {
    "job_title": "Data Engineer (Mid to Senior Level) – Remote (Nigeria)",
    "description": "Proven experience with cloud data platforms and big data technologies. Collaborate with data scientists, analysts, and software engineers to deliver data…&hellip;",
    "skills": []
  },
  {
    "job_title": "DEVOPS ENGINEERS",
    "description": "Knowledge on Infra Management with Hybrid environment and cloud security. As a part of our team you will be responsible for ensuring system stable operations…&hellip;",
    "skills": [
      "security",
      "cloud"
    ]
  },
  {
    "job_title": "Fullstack Engineer",
    "description": "Familiarity with cloud platforms (AWS, GCP, or DigitalOcean). Remote (Work From Home) Full Time. IT & Telecoms NGN 250,000 - 400,000 Negotiable.&hellip;",
    "skills": [
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "Project Manager",
    "description": "Understanding of APIs, cloud platforms, and software deployment processes. Lead and manage the R&D team, ensuring seamless collaboration between AI/ML engineers…&hellip;",
    "skills": [
      "apis",
      "cloud"
    ]
  },
  {
    "job_title": "Data Engineer",
    "description": "Experience with cloud platforms (e.g. Google Cloud, AWS, Azure). Moniepoint is Africa's all-in-one financial ecosystem, empowering businesses and their…&hellip;",
    "skills": [
      "azure",
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "AI & Machine Learning Engineer",
    "description": "Familiarity with cloud-based telecommunications solutions (e.g., AWS, Azure). Experience designing and deploying end to end ML workflows on at least one major…&hellip;",
    "skills": [
      "azure",
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "DevOps Engineer",
    "description": "Working knowledge of various tools, open-source technologies, and cloud services. Successful candidate must be agile enough to wear a technical hat and manage…&hellip;",
    "skills": []
  },
  {
    "job_title": "System Administrator",
    "description": "Experience with virtualization technologies (e.g., VMware, KVM) and cloud platforms (e.g., AWS, Azure) is desirable.&hellip;",
    "skills": [
      "azure",
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "Senior Full Stack Developer",
    "description": "Experience with Vultr cloud hosting is required. Integrate and optimize services on Vultr and AWS cloud environments. Prior experience in HR Tech or Fintech.&hellip;",
    "skills": [
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "Software Engineer",
    "description": "Deploying applications using cloud services like AWS, Azure, or Google Cloud. Writing clean, efficient, and maintainable code in programming languages like…&hellip;",
    "skills": [
      "azure",
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "AI Vision Engineer",
    "description": "Collaborate closely with AI engineers, product managers, and content creators to define and execute on visual AI features.&hellip;",
    "skills": []
  },
  {
    "job_title": "Machine Learning Engineer",
    "description": "Familiarity with version control (Git) and cloud services (AWS, GCP, Azure) preferred. Remote (Work From Home) Full Time.&hellip;",
    "skills": [
      "azure",
      "cloud",
      "aws",
      "git"
    ]
  },
  {
    "job_title": "Data & ML Engineer",
    "description": "You will work with the clients customers and focus on their AWS Analytics and ML service offerings such Amazon Kinesis, AWS Glue, Amazon Redshift, Amazon EMR,…&hellip;",
    "skills": []
  },
  {
    "job_title": "System Administrator",
    "description": "Familiarity with cloud platforms (AWS, Azure). The System Administrator will be responsible for managing and maintaining the organization's IT infrastructure to…&hellip;",
    "skills": [
      "azure",
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "BI / Data Analyst (Mid to Senior Level)",
    "description": "Stay current on industry trends, tools, and best practices in data engineering, analytics, and cloud data platforms. Data Engineering: 4 years (Preferred).&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Engineer (Python)",
    "description": "Experience with cloud platforms like AWS or Azure. Collaborate with cross-functional teams including frontend engineers and product managers.&hellip;",
    "skills": [
      "azure",
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "DevOps Engineer",
    "description": "Proficiency in one or more cloud providers. Ensure reliable, fast, and efficient software delivery by enabling continuous integration, continuous delivery (CI/…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full stack engineer",
    "description": "Familiarity with cloud platforms like AWS, Azure, or Google Cloud. The ideal candidate will be responsible not only for software development but also for…&hellip;",
    "skills": [
      "azure",
      "cloud",
      "aws"
    ]
  },
  {
    "job_title": "Senior Backend Engineer",
    "description": "Work with engineers across the company to build and maintain new features at a large scale. We help food vendors deliver meals seamlessly while providing…&hellip;",
    "skills": []
  },
  {
    "job_title": "DevOps (Systems Administrator) Engineer",
    "description": "Design security architecture and implement systems to ensure host systems are safe and secure against cybersecurity threats. Job Types: Full-time, Permanent.&hellip;",
    "skills": []
  },
  {
    "job_title": "Cybersecurity Engineer",
    "description": "3+ years of proven experience in cybersecurity roles. The ideal candidate has hands-on experience in cybersecurity frameworks, penetration testing, cloud…&hellip;",
    "skills": []
  },
  {
    "job_title": "Cybersecurity Engineer",
    "description": "∙ Conduct regular security assessments, vulnerability scanning, and penetration testing to identify and remediate potential security gaps across the…&hellip;",
    "skills": []
  },
  {
    "job_title": "Cybersecurity Engineer",
    "description": "Interpret security and technical requirements into business requirements and communicate security risks to relevant stakeholders ranging from business leaders…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "Understanding of cybersecurity principles and best practices. The ideal candidate is a *well-rounded engineer* who thrives on solving complex problems, shipping…&hellip;",
    "skills": []
  },
  {
    "job_title": "SOC Analyst (Defensive Engineer)",
    "description": "In this role, you will be responsible for monitoring security tools such as SIEM and EDR for indicators of compromise, developing and refining detection rules,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Security Engineer",
    "description": "Security engineer: 5 years (Required). Design and maintain our cybersecurity architecture in line with best practices.&hellip;",
    "skills": []
  },
  {
    "job_title": "Technical Support Engineer 2 - MW SCIM",
    "description": "Mentor junior support engineers as needed or requested by management. We’re seeking a customer-oriented Technical Support Engineer 2 - SCIM to work on behalf of…&hellip;",
    "skills": []
  },
  {
    "job_title": "DevOps Engineer",
    "description": "Deploy: Identifying and deploying cybersecurity measures by continuously performing vulnerability assessment and risk management.&hellip;",
    "skills": []
  },
  {
    "job_title": "System Administrator",
    "description": "Expertise in network protocols (TCP/IP, DNS, DHCP) and cybersecurity principles. The System Administrator will be responsible for managing and maintaining the…&hellip;",
    "skills": []
  },
  {
    "job_title": "Tech Recruiter",
    "description": "Manage outreach campaigns targeted at onboarding skilled freelancers with a focus on tech talent such as software developers, designers, data professionals,…&hellip;",
    "skills": []
  },
  {
    "job_title": "General Manager - IT Infrastructure",
    "description": "Implement and enforce cybersecurity architecture to safeguard IT assets, networks, and data. Lead and develop a high-performance team of IT engineers,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Chief Technology Officer",
    "description": "Ensure compliance with relevant regulations and industry standards governing financial technology, data privacy, and cybersecurity.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Tester/QA Engineer",
    "description": "The role will be able to assess software quality through a combination of manual and automated testing. They will be able to identify and report bugs and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Network Engineer",
    "description": "The ideal candidate will also have a solid understanding of cybersecurity and ethical hacking principles to ensure the integrity and security of our network.&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Engineer",
    "description": "Collaborate with designers and engineers to ensure design consistency and feasibility. We're seeking an experienced UI/UX Engineer, who will be responsible for…&hellip;",
    "skills": []
  },
  {
    "job_title": "Information Security Officer",
    "description": "Conduct employee security awareness training and foster a culture of cybersecurity within the organization. Prior involvement in Crisis Management or leading…&hellip;",
    "skills": []
  },
  {
    "job_title": "Technical Writer",
    "description": "Knowledge of payment systems, blockchain, or cybersecurity. Work closely with engineers, product managers, and QA teams to gather technical details.&hellip;",
    "skills": []
  },
  {
    "job_title": "Head of Training",
    "description": "Deep knowledge of software development lifecycle, cloud, DevOps, or cybersecurity. Work closely with department heads, product managers, and engineers to…&hellip;",
    "skills": []
  },
  {
    "job_title": "Embedded Technology Engineering Specialist",
    "description": "Familiarity with cybersecurity practices and container orchestration. A top facility management and smart solutions firm, is hiring an Embedded Technology…&hellip;",
    "skills": []
  },
  {
    "job_title": "Technical Support Advocate Stage 2 - Consumer",
    "description": "Mentor junior support engineers as needed. Collaborate and share guidance with technical engineers, subject matter experts, and other team members to validate…&hellip;",
    "skills": []
  },
  {
    "job_title": "Manager, Information Security",
    "description": "Familiar with security controls or concepts related to various security community groups or standards: CISSP Domains, NIST cybersecurity & privacy frameworks,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Head of Engineering and Technical Services",
    "description": "Expertise in cybersecurity principles, practices, and technologies. Implement and enforce comprehensive cybersecurity policies, procedures, and technical…&hellip;",
    "skills": []
  },
  {
    "job_title": "Front-End Javascript Developer",
    "description": "*Product Implementation*: : SaaS, iOS Apps, web SPA, small to medium size to large business automation. 5+ years coding plain Javascript.&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Web Developer",
    "description": "Develop web sites in LARAVEL; Excellent Understanding web development life cycle; Designing and creating databases for web pages; Experience with UI/UX Design;&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer",
    "description": "Deliver excellent user experiences on both web pages and web applications. Minimum of 1 year of proven work experience as a web developer.&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer (Fullstack)",
    "description": "Maintain and improve existing websites and web applications. Collaborate with UI/UX designers to translate design mockups into functional web pages.&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer",
    "description": "Design and develop responsive websites and web applications. Collaborate with designers and other developers to execute projects efficiently.&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer",
    "description": "Are you passionate about developing state-of-the-art HTML5 mobile apps? Do you have an eye for good design and a feel for innovative user interfaces? Join our…&hellip;",
    "skills": []
  },
  {
    "job_title": "Fullstack Web Developer (Next.js) – Remote",
    "description": "Job Type: Part-time / Freelance (with potential to grow into full-time). Location: Remote (UK or GMT time zone preferred).&hellip;",
    "skills": []
  },
  {
    "job_title": "Skilled Webflow Developer",
    "description": "I am seeking a skilled freelancer to design and build a high-converting landing page using Webflow. It needs to build trust and interest to encourage sign-ups.&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer",
    "description": "We are looking for a skilled web developer who will be responsible for developing and/or designing websites for our company. Main strength is Word-press.&hellip;",
    "skills": []
  },
  {
    "job_title": "Front-End Developer",
    "description": "Collaborate with backend developers and UI/UX designers to implement features. You will be responsible for building and optimizing user interfaces for web…&hellip;",
    "skills": []
  },
  {
    "job_title": "Back-End Developer",
    "description": "You will be responsible for developing, optimizing, and maintaining server-side logic, APIs, and databases. Design and implement secure and efficient RESTful…&hellip;",
    "skills": []
  },
  {
    "job_title": "SEO Specialist",
    "description": "Partner with web developers to implement SEO best practices. *Collaboration Skills*: Experience working cross-functionally with developers, designers, and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer",
    "description": "Now Hiring: Web Developer (Full Stack – Entry Level). Employment Type: Full-time Work Schedule: Monday – Friday | 9:00am – 5:00pm.&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer",
    "description": "Prove experience as a web developer,. Ensure compliance with web standards and best practices. Develop responsive websites and web applications using modern…&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer",
    "description": "Understanding of SEO best practices and web analytics tools (e.g., Google Analytics). Interested and qualified candidates should send their CV, portfolio (with…&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer",
    "description": "Compovine Technologies Limited is an indigenous company with the main aim of offering Information Technology, Sales and Services to individuals and corporate…&hellip;",
    "skills": []
  },
  {
    "job_title": "WEB DEVELOPER",
    "description": "To monitor web server and site technical performance. Ability to create mobile phone web interface, develop mobile applications.&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Designer",
    "description": "Collaboration & Coordination: Work closely with developers to translate designs into interactive digital experiences. Remote (Work From Home) Full Time.&hellip;",
    "skills": []
  },
  {
    "job_title": "Python Web (Django) Developer",
    "description": "We are looking for a long-term Python Web Developer with experience using Django (most preferred) and Flask frameworks while working with little or no…&hellip;",
    "skills": [
      "python",
      "flask",
      "django"
    ]
  },
  {
    "job_title": "Web Developer",
    "description": "Proven years of experience in web development. You will work closely with designers, product managers, and backend developers to deliver scalable and secure…&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer",
    "description": "Candidate must have a strong understanding of UI, cross-browser compatibility, general web functions and standards.&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Wordpress Developer",
    "description": "Keep up with emerging trends in web design, development, and WordPress best practices. We are seeking a talented and versatile WordPress Web developer with a…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Web Developer",
    "description": "Ability to optimize web applications for different platforms and devices. Collaborate with designers to turn wireframes and mockups into user-friendly web…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer",
    "description": "Collaborate with frontend developers to integrate user-facing elements with server-side logic. The successful candidate will be responsible for building and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Progressive Web Application Developer (React.Js)",
    "description": "Retail, Fashion & FMCG NGN 600,000 - 900,000. As a PWA Senior Mobile App Developer on IOS and Android, you will be responsible for building features end-to-end…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer (Mid to Senior Level) – Remote (Nigeria)",
    "description": "Collaborate with frontend developers, DevOps, and product teams to deliver integrated solutions. Develop and maintain robust backend services and APIs to…&hellip;",
    "skills": []
  },
  {
    "job_title": "PHP Developer",
    "description": "Strong knowledge of PHP web frameworks. Strong knowledge of the common PHP or web server exploits and their solutions. Integration of data storage solutions.&hellip;",
    "skills": []
  },
  {
    "job_title": "WordPress Web Developer",
    "description": "Collaborate with developers, marketers, and clients for seamless execution. Design and build responsive WordPress websites from concept to completion.&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend React JS Developer, Doctoora",
    "description": "Responsible for development of new highly-responsive, web-based user interface. We provide fully serviced medical facilities to healthcare professionals on a…&hellip;",
    "skills": []
  },
  {
    "job_title": "Next js Frontend Developer (Typescript, Tailwind and Rest API consumption) Expert",
    "description": "Optimize web applications for maximum speed and scalability. UX Product designers and back-end developers to implement user-friendly interfaces based on…&hellip;",
    "skills": []
  },
  {
    "job_title": "Next.js Developer (Temporary Contract)",
    "description": "Link to *the cleanest web application or component library you’ve built* (live URL or Git repo). We have a short-term, high-impact project that needs a sharp…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer",
    "description": "You will maintain basic developer hygiene that includes but not limited to, writing tests, using loggers. Use DevOps best practices that include model serving,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend Web Developer (Vue.js)",
    "description": "A front-end web developer will be responsible for implementing visual elements that users see and interact with within a web application.&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend Developer",
    "description": "Design and code web pages to be responsive. Ensure that web content is accessible to all users. Track changes, collaborate with other developers, and maintain…&hellip;",
    "skills": []
  },
  {
    "job_title": "SOFTWARE DEVELOPER",
    "description": "Carry out Code review with other Software developers. He will also assist other developers and other IT units in deploying software solutions for the business.&hellip;",
    "skills": []
  },
  {
    "job_title": "Back-End Developer",
    "description": "Design, implement and/or use RESTful web services. Work with other developers, data scientists, system engineers, and other technical experts to develop and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Software Developer",
    "description": "Collaborate with Team: Work in an agile environment alongside lead developer, trainee developer, and other team members to deliver new product and improvements.&hellip;",
    "skills": []
  },
  {
    "job_title": "experienced web developer/ social media manager",
    "description": "our organization needs an experienced web developer/social media manager to join our team. Job Type: Full…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer",
    "description": "Collaborate with frontend developers and other team members. The ideal candidate will be responsible for designing, developing, and maintaining backend systems…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "We seek skilled Full Stack Developers proficient in C# or Python for backend development and REACT to design, develop, and maintain scalable web applications.&hellip;",
    "skills": [
      "python",
      "react"
    ]
  },
  {
    "job_title": "Web Designer",
    "description": "Work with developers or CMS platforms (e.g., Shopify, WordPress, Webflow) to implement designs. 1-3 years of experience in web design, preferably for e-commerce…&hellip;",
    "skills": []
  },
  {
    "job_title": "FULL STACK DEVELOPER",
    "description": "Full stack developers are responsible for developing and designing front end web architecture, ensuring the responsiveness of applications, and working…&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend Developer",
    "description": "Collaborate with back-end developers and web designers to improve usability. Maintain and improve website or web application performance and functionality.&hellip;",
    "skills": []
  },
  {
    "job_title": "Python Trainee Developer (Internship)",
    "description": "To assist the team in the design, development, programming, deployment, project documentations, and other tasks during various client projects.&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Backend Developer (Corper)",
    "description": "Familiarity with databases (like MySQL and MongoDB), web servers (e.g., Apache) , and UI/UX design. You’ll work closely with senior developers, front-end…&hellip;",
    "skills": []
  },
  {
    "job_title": "Customer Success Associate (Technical Based)",
    "description": "This position is available for candidates working as product designers, web designers, web developers, etc. without customer support experience.&hellip;",
    "skills": []
  },
  {
    "job_title": "Wordpress Theme Developer",
    "description": "*Collaboration:* Working with designers, content creators, and other developers to deliver functional and user-friendly websites.&hellip;",
    "skills": []
  },
  {
    "job_title": ".Net developer",
    "description": "Coordinate with other software professionals and developers. Use and adapt existing web applications for apps. Write clean, scalable code using .&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer (Web & AI Workflows)",
    "description": "Staying updated with the latest advancements inAI/ML tools and web technologies. Developing and maintainingscalable web applicationsusingReact (frontend) and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Java Enterprise (Web) Software Developer",
    "description": "Strong knowledge of web server exploits and their solutions. Top-notch programming skills and in-depth knowledge of modern web development technology.&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend Developer",
    "description": "Working with backend developers to integrate frontend components with APIs. Developing and maintaining high-quality user interfaces using React.js for web…&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Designer",
    "description": "Collaborate with developers, product managers, and marketing to ensure seamless implementation of designs. The ideal candidate will play a key role in enhancing…&hellip;",
    "skills": []
  },
  {
    "job_title": "C# DEVELOPER",
    "description": "NET, MVC, Web API, and Entity Framework, particularly in building robust web trading interfaces.*. Design, develop, test, and maintain high-performance C#…&hellip;",
    "skills": []
  },
  {
    "job_title": "Node.Js Developer",
    "description": "Experienced with profiling and optimizing the performance of a web application (such as with Chrome developer tools). Adapt, own the Node development pipeline.&hellip;",
    "skills": []
  },
  {
    "job_title": "Dart/Flutter Developer",
    "description": "Experience with RESTful APIs and web services integration. Collaborate with product managers, designers, and backend developers to deliver cohesive and robust…&hellip;",
    "skills": []
  },
  {
    "job_title": "PHP Developer",
    "description": "Responding to integration requests from front-end developers. Finalizing back-end features and testing web applications. Familiarity with SQL/NoSQL databases.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Backend Developer Python (FastAPI/Flask)",
    "description": "We’re seeking a Senior Backend Developer to lead the design, implementation, and maintenance of our Python-based backend services using FastAPI.&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend Developer",
    "description": "Other vital soft skills in the front-end web developer job role include the ability to solve problems and adapt quickly to new web design and application trends…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graduate Software Developer - Trainee",
    "description": "Familiarity with web development concepts (HTML, CSS, JavaScript). *Development:* Assist in developing and maintaining web applications using C# and Blazor.&hellip;",
    "skills": [
      "css",
      "javascript",
      "html"
    ]
  },
  {
    "job_title": "Front End Developer",
    "description": "Integrate APIs and work with back-end developers when needed. Eunantech is looking for a skilled and creative Front-End Developer to help us build clean, user-…&hellip;",
    "skills": []
  },
  {
    "job_title": "Front-End Javascript Developer",
    "description": "Otherwise, you must be comfortable grabbing the initiative and communicating your ideas in easily understood terms and using the simplest tools, not require any…&hellip;",
    "skills": []
  },
  {
    "job_title": "DevOps (Systems Administrator) Engineer",
    "description": "The COVID-19 pandemic upturned closely held assumptions everywhere. To reliably deploy solutions in the cloud, ensuring a seamless hand-off of code releases…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "3+ years of full-stack development experience. We seek skilled Full Stack Developers proficient in C# or Python for backend development and REACT to design,…&hellip;",
    "skills": [
      "python",
      "react"
    ]
  },
  {
    "job_title": "FULL STACK DEVELOPER",
    "description": "Full stack development: 5 years (Required). Full stack developers will be required to see out a project from conception to final product, requiring good…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Full Stack Developer",
    "description": "Design, build, and maintain scalable full-stack applications for HR and payroll platforms. Collaborate with cross-functional teams including developers, product…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer Tutor",
    "description": "We Seek a full-stack developer tutor to teach and train young students in full-stack development part-time, 4 days per week. Remote (Work From Home) Part Time.&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer (Python/React)",
    "description": "Collaborating with a team of developers on a client project. Ability to collaborate with a team of developers and work closely with project managers to deliver…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "Ibadan & Oyo State Full Time. Build and maintain web applications with a focus on seamless front-end and back-end integration.&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "You’ll be part of a cross-functional team that’s responsible for the full software development life cycle, from conception to deployment.&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "7+ years of full stack development experience, ideally in fintech or high-scale transactional systems. Mentor junior developers and contribute to technical…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "We are currently looking for a full-time web developer, who can hit the ground running; to join the Doctoora team in improving our platform and adding new…&hellip;",
    "skills": []
  },
  {
    "job_title": "FULL STACK SOFTWARE DEVELOPER",
    "description": "MERN stack (MongoDB,Express.JS, ReactJS, NodeJS). . Develop and maintain web applications using the MERN stack (MongoDB, Express.js, React.js, Node.js).&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer (MERN)",
    "description": "You will be responsible for developing and maintaining high-performance web applications using the MERN stack (MongoDB, Express.js, React.js, Node.js).&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Full-Stack Developer",
    "description": "5+ years of professional experience building full-stack web applications. Build, and maintain scalable full-stack applications using React, React Native, and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "In this role, you will design, develop, and maintain robust web applications and services, working across both the front-end and back-end to deliver seamless…&hellip;",
    "skills": []
  },
  {
    "job_title": "SENIOR FULL STACK DEVELOPER",
    "description": "Minimum of 10 years of experience in full stack development, with a track record of leading and mentoring engineering teams.&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Web Developer",
    "description": "Proven experience working with the MERN stack or other JavaScript frameworks and libraries. Work closely with a team of developers, designers, and product…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full-Stack Developer (React + Next.js + Supabase)",
    "description": "We’re looking for a *Full-Stack Developer* to join our project on a *monthly contract* basis. You’ll be building and maintaining web apps using.&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "Banking, Finance & Insurance NGN 250,000 - 400,000. Collaborate with the development team and product managers to ideate software solutions.&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "Collaborate with UI/UX designers and other developers. You will be responsible for both front-end and back-end development, working closely with our design and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Full Stack Developer",
    "description": "3 to 5+ years of experience in full-stack development. The Senior Software Developer will design, code and implement web and mobile app solutions, contributing…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full-Stack Developer",
    "description": "2-3 years of working experience as a Full-stack Developer. Participate in the full software development lifecycle, from concept to deployment and ongoing…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "Stay updated with emerging technologies and best practices in full-stack and mobile development. You will be responsible for designing, developing, and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Software Developer",
    "description": "We are seeking a skilled Full Stack Developer to design, develop, and maintain high-performance, scalable software solutions.&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Software Developer",
    "description": "Must be willing to work full time on-site. This is a full-time on-site role for a Frontend and Backend Developer. A strong visual and technical portfolio.&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "As a Full-stack developer, you will be responsible for producing scalable software solutions. You will be a part of a cross-functional team that is responsible…&hellip;",
    "skills": []
  },
  {
    "job_title": "MERN Stack Developer",
    "description": "Proven experience working with the MERN stack or other JavaScript frameworks and libraries. Work closely with a team of developers, designers, and product…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "Port Harcourt & Rivers State Full Time. Banking, Finance & Insurance NGN 250,000 - 400,000. Manage the entire software development lifecycle from concept to…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Full Stack Developer (Java Spring & TypeScript)",
    "description": "Develop and maintain scalable full-stack applications using Java Spring Boot (backend) and TypeScript (frontend frameworks like Angular/React).&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer (Web & AI Workflows)",
    "description": "Zocode Limited is established as a Business Resources Provider registered with the Corporate Affairs Commission in Nigeria, we provide business solutions to…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "Minimum of 2-3 years of experience in full-stack web development. We are looking for a creative and highly skilled Full Stack Developer with strong WordPress…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer",
    "description": "You will maintain basic developer hygiene that includes but not limited to, writing tests, using loggers. Use DevOps best practices that include model serving,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Software Developer (Java)",
    "description": "You must be passionate in understanding the business context for features built to drive better customer experience and adoption.&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer (Fullstack)",
    "description": "Develop front-end and/or back-end components, depending on the role (Full-stack, Front-end, or Back-end). The ideal candidate will be responsible for building…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer - Platform Infrastructure",
    "description": "Working Model: Our flexible work arrangement combines both remote and in-office work, optimizing flexibility and productivity.&hellip;",
    "skills": []
  },
  {
    "job_title": "Full-Stack Developer - Beauty Marketplace",
    "description": "*3+ years* full-stack development experience. It is full time ON-SITE, Abuja. We're building Nigeria's most trusted beauty marketplace, starting with hair…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Engineer",
    "description": "Version Control: Use tools like Git to manage code versions and collaborate with other developers. Cross-functional Collaboration: Work closely with other…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full-stack web developer",
    "description": "Develop and deliver hands-on training sessions in full-stack web development. What We’re Looking For: *. ✅ PHP & Laravel Expertise: Advanced proficiency in PHP…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer (asp.net)",
    "description": "Net Core, JavaScript, and other programming languages. Collaborate with cross-functional teams to design, develop, and implement software solutions.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Developer (Full Stack)",
    "description": "4 - 6 years of experience as a full-stack developer. Job Position: Software Developer (Full Stack). Write clean, efficient, and maintainable code while…&hellip;",
    "skills": []
  },
  {
    "job_title": "Project Manager (Full Stack Development Experience)",
    "description": "3+ years of experience in project management, with at least 2 years of full stack development experience. The ideal candidate combines strong project management…&hellip;",
    "skills": []
  },
  {
    "job_title": "Javascript Backend Developer (Node.JS)",
    "description": "Integration of user-facing applications/elements developed by the front-end developer. We are looking for a motivated JavaScript Backend Developer (NodeJS) with…&hellip;",
    "skills": []
  },
  {
    "job_title": "Middle Full Stack Software Engineer",
    "description": "This tool is used by Financial Advisors who create financial strategies for their clients and help to achieve clients’ financial goals using the buckets…&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer",
    "description": "Collaborate with front-end developers, designers, and other stakeholders to deliver complete full-stack solutions. Port Harcourt & Rivers State Full Time.&hellip;",
    "skills": []
  },
  {
    "job_title": "MERN Stack Intern",
    "description": "Basic knowledge of web development and the MERN stack. The ideal candidate will work on real projects, receive mentorship from experienced developers.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Backend Developer Python (FastAPI/Flask)",
    "description": "Ownership: Take full responsibility for our backend stack. We’re seeking a Senior Backend Developer to lead the design, implementation, and maintenance of our…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile App Developer (Frontend/Backend/Fullstack)",
    "description": "Minimum of 3years+ proven work experience as a Mobile app developer. As a Mobile developer, you’ll collaborate with our internal teams to develop functional…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "*Full Stack Development:* Analyze, design, prototype, develop, test, troubleshoot, support, maintain and update the complete software lifecycle in your hands at…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Developer",
    "description": "We are seeking to hire an experienced software developer proficient in full stack development with main focus on backend. Experience with React Native/Expo.&hellip;",
    "skills": []
  },
  {
    "job_title": "Full-Stack Developer (React Native, React.js, Node.js/Python)",
    "description": "3+ years of hands-on experience in full-stack development. We are seeking a Full-Stack Developer with 3+ years of experience who has expertise in both custom…&hellip;",
    "skills": []
  },
  {
    "job_title": "MERN Stack Intern",
    "description": "Basic knowledge of web development and the MERN stack. Assist in the design and development of web applications using the MERN stack.&hellip;",
    "skills": []
  },
  {
    "job_title": "MERN Stack Intern",
    "description": "Experience or knowledge of MERN stack development. Receive mentorship and feedback from senior developers. Gain hands-on experience in MERN stack development.&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer",
    "description": "Now Hiring: Web Developer (Full Stack – Entry Level). Employment Type: Full-time Work Schedule: Monday – Friday | 9:00am – 5:00pm. Pay: ₦150,000.00 per month.&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer",
    "description": "Prove experience as a web developer,. Outsource Nigeria is a full-service Human Resources agency, specializing in providing outsourced turnkey manpower…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mid-Level Software Engineer (Full-Stack)",
    "description": "Collaboration: Work closely with senior developers and engineers to implement solutions efficiently. Employment Type: 6–12-month Contract (Full-Time) /…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Full Stack Software Engineer",
    "description": "Collaborate & Elevate: Conduct impactful code reviews, mentoring junior developers and fostering a collaborative team environment that encourages knowledge…&hellip;",
    "skills": []
  },
  {
    "job_title": "Business Intelligence Developer",
    "description": "Fair knowledge of Microsoft BI stack (SSIS, SSRS, SSAS) or any other reputable reporting / OLAP tools. We are seeking a skilled Business Intelligence Developer…&hellip;",
    "skills": []
  },
  {
    "job_title": "Lead Full Stack Engineer",
    "description": "Proven experience as a Full Stack Engineer or similar role (5+ years required). Strong proficiency in front-end technologies such as HTML, CSS, JavaScript, and…&hellip;",
    "skills": [
      "css",
      "javascript",
      "html"
    ]
  },
  {
    "job_title": "SENIOR PHP DEVELOPER",
    "description": "As a PHP Developer who is very good working with laravel and frontend mark languages like css and html, you will be working alongside our Senior web developers…&hellip;",
    "skills": [
      "css",
      "html",
      "php"
    ]
  },
  {
    "job_title": "Bubble Low-code Developer 2",
    "description": "We are looking for a full-stack Low-code developer for the following levels. Excellent collaboration skills with both UI/UX designers, backend developers,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile App Developer (Mid to Senior Level) – Remote (Nigeria)",
    "description": "Familiarity with mobile app accessibility and SEO best practices. Knowledge of mobile payment integrations and in-app purchases.&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile App Developer",
    "description": "The ideal candidate will be able to build mobile apps for both Android and IOS platforms. Remote (Work From Home) Full Time.&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile App Developer",
    "description": "Familiarity with mobile security and testing frameworks. Troubleshoot bugs, perform upgrades and deploy app updates. Remote (Work From Home) Contract.&hellip;",
    "skills": []
  },
  {
    "job_title": "Flutter Mobile App Developer",
    "description": "Ex*perience:* Typically 1-3 years of experience in mobile app development, with a focus on Flutter. *Performance Optimization: *Experience with optimizing app…&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Mobile App Developer/Intern",
    "description": "Real-world experience in mobile app development. Assist in developing and maintaining mobile applications. Collaborate with designers and backend developers to…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile App Developer (Frontend/Backend/Fullstack)",
    "description": "Minimum of 3years+ proven work experience as a Mobile app developer. As a Mobile developer, you’ll collaborate with our internal teams to develop functional…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile App Trainee (June 2025)",
    "description": "Develop and maintain mobile app features under the guidance of experienced developers. Basic understanding of mobile app development principles and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Skilled Webflow Developer",
    "description": "Ensure the design is fully responsive for both desktop and mobile devices. I am seeking a skilled freelancer to design and build a high-converting landing page…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile App Developer Intern (Flutter/Dart)",
    "description": "Good grasp of *mobile app architecture* and state management (e.g., Provider, Riverpod, BLoC). The ideal candidate is familiar with cross-platform mobile…&hellip;",
    "skills": []
  },
  {
    "job_title": "Trainee Mobile App Developer (Internship)",
    "description": "This is a short term internship ( 6 months – 1 year contract) position. Suitable for industrial attachment (minimum 6 months), NYSC and Fresh Graduates.&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile Developer",
    "description": "Produce fully functional mobile applications writing clean code. Proven hands-on experience and knowledge in mobile development. Job Types: Part-time, Contract.&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile App developer - Flutter",
    "description": "2–4 years of mobile app development experience, with *at least 1–2 years in Flutter*. Optimize app performance and troubleshoot bugs across Android and iOS.&hellip;",
    "skills": []
  },
  {
    "job_title": "Backend Developer – Crypto/Coin-Based/Transaction Monitoring & Mobile Communication App (Laravel)",
    "description": "Build robust, scalable server-side logic that supports mobile and web applications. Prior experience in building or supporting crypto-based transaction…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile Developer",
    "description": "Produce fully functional mobile applications writing clean code. Research and suggest new mobile products, applications and protocols.&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile Application Developer (IOS / Android)",
    "description": "Mentorship and guidance from experienced developers. Potential revenue share from successful app deployments. A basic understanding of app publishing processes…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile Application Developer",
    "description": "A qualified Mobile App. developer who will collaborate with internal teams to develop functional mobile applications, while working in a fast-paced environment.&hellip;",
    "skills": []
  },
  {
    "job_title": "React Native Mobile App Developer",
    "description": "Familiar with mobile app testing and debugging tools. Optimize app performance and ensure responsiveness. Collaborate with designers and backend developers.&hellip;",
    "skills": []
  },
  {
    "job_title": "App Developer",
    "description": "Strong understanding of mobile app design principles, user interface guidelines, and best practices. Experience with mobile app development frameworks and tools…&hellip;",
    "skills": []
  },
  {
    "job_title": "Swift Developer with Flutter Experience",
    "description": "Experience in building mobile applications for both iOS and Android platforms. Design and build high-quality, scalable mobile applications using Flutter.&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile (Flutter) Developer",
    "description": "Knowledge of mobile app architecture patterns (e.g., MVC, MVVM). This role requires a hands-on developer who can manage the mobile development lifecycle, from…&hellip;",
    "skills": []
  },
  {
    "job_title": "Intermediate Mobile Apps Developer (Flutter)",
    "description": "Strong understanding of cross-platform mobile architecture and performance considerations. Write unit and widget tests to ensure app stability and performance.&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile Application Developer",
    "description": "Analyze the needs and preferences of mobile app users. Proven work experience as a Mobile developer. Create app interfaces that are user-friendly and intuitive.&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile Application Developer",
    "description": "Create and maintain mobile applications. Keep abreast of the latest technology for mobile applications. Familiarity with RESTful APIs and mobile libraries for…&hellip;",
    "skills": []
  },
  {
    "job_title": "Next.js Developer (Temporary Contract)",
    "description": "We have a short-term, high-impact project that needs a sharp Next.js developer who cares as much about design precision as clean code.&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Designer",
    "description": "Design user-friendly and visually appealing interfaces for the Esosa e-commerce website and mobile app. Collaborate with developers, product managers, and…&hellip;",
    "skills": []
  },
  {
    "job_title": "React Native Developer",
    "description": "Handle push notifications, in-app messaging, and mobile security practices. Optimize mobile app performance for low-resource environments (offline-first, image…&hellip;",
    "skills": []
  },
  {
    "job_title": "Flutter Developer",
    "description": "Solid experience in mobile app development with Flutter. Strong understanding of UI/UX design principles and mobile app interfaces.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Developer",
    "description": "We are seeking to hire an experienced software developer proficient in full stack development with main focus on backend. Experience with React Native/Expo.&hellip;",
    "skills": []
  },
  {
    "job_title": "Industrial Attachment Vacancies (Internship)",
    "description": "This position is suitable for students currently seeking a place to undertake their Industrial Attachment Training (6 months or 1 year).&hellip;",
    "skills": []
  },
  {
    "job_title": "E-commerce and Mobile App Operations Manager",
    "description": "Collaborate with developers to ensure app functionality and resolve bugs. Analyse app user behaviour to improve engagement and retention.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Full-Stack Developer",
    "description": "Understanding of native mobile modules or bridging in React Native. Mentor and guide junior and mid-level developers. Job Types: Full-time, Permanent.&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend Developer (Angular)",
    "description": "Streamlined user experience in the form of a Java-based desktop and mobile web-app. In this position, you will be responsible for creating a top-level coding-…&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer",
    "description": "Prove experience as a web developer,. Strong understanding of responsive design principles and mobile-first approach.&hellip;",
    "skills": []
  },
  {
    "job_title": "Quality Assurance Engineer",
    "description": "Collaborate closely with developers, product managers, data scientist and designers to understand requirements and define quality standards.&hellip;",
    "skills": []
  },
  {
    "job_title": "Front-end Developer (Flutter)",
    "description": "Experience with mobile app development (e.g., React Native, Flutter) for cross-platform crypto apps. Excellent communication skills to collaborate with…&hellip;",
    "skills": []
  },
  {
    "job_title": "Tech Lead",
    "description": "Identify and address skill gaps within the team; mentor and guide junior developers. As we expand, we are seeking a highly skilled *Tech Lead* to oversee and…&hellip;",
    "skills": []
  },
  {
    "job_title": "React.Native Developer",
    "description": "Build pixel-perfect, performant, and smooth UIs across both mobile platforms. Stay up-to-date with the latest trends and best practices in mobile development…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Full Stack Developer",
    "description": "The Senior Software Developer will design, code and implement web and mobile app solutions, contributing primarily in a full-stack application suite for our…&hellip;",
    "skills": []
  },
  {
    "job_title": "Android Developer",
    "description": "As an Android developer, you will need to be familiar with the Android ecosystem and mobile app development, including familiarity with popular app frameworks…&hellip;",
    "skills": []
  },
  {
    "job_title": "Progressive Web Application Developer (React.Js)",
    "description": "Build pixel-perfect, performant, and smooth UIs across both mobile platforms. Stay up-to-date with the latest trends and best practices in mobile development…&hellip;",
    "skills": []
  },
  {
    "job_title": "Flutter Developer",
    "description": "Strong understanding of mobile app architecture and state management (e.g., Provider, Bloc, Riverpod). Solid understanding of mobile application architecture…&hellip;",
    "skills": []
  },
  {
    "job_title": "Android Developer",
    "description": "System Integration: Collaborate with backend developers to ensure the seamless integration of mobile app functionalities with backend systems, particularly in…&hellip;",
    "skills": []
  },
  {
    "job_title": "Flutter Developer",
    "description": "We're hiring a Flutter developer to build and maintain cross-platform mobile apps. Develop mobile apps using Flutter and Dart. Minimum of 3 years of experience.&hellip;",
    "skills": []
  },
  {
    "job_title": "Full Stack Developer",
    "description": "Design, develop, and deploy mobile applications for iOS and Android platforms. Stay updated with emerging technologies and best practices in full-stack and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Angular Ionic & C# Developer",
    "description": "Mobile Ecosystem: Understanding of native plugin integration (Cordova/Capacitor), push notifications, and mobile app store submission processes.&hellip;",
    "skills": []
  },
  {
    "job_title": "MERN Stack Intern",
    "description": "Collaborate with other developers and stakeholders to deliver high-quality products. Metricoid Technology Solutions is a software development company…&hellip;",
    "skills": []
  },
  {
    "job_title": "Fullstack Develpoer",
    "description": "5+ years of experience in mobile app development with React Native. Collaborate with backend developers, designers, and product managers to define app features…&hellip;",
    "skills": []
  },
  {
    "job_title": "MERN Stack Intern",
    "description": "The ideal candidate will work on real projects, receive mentorship from experienced developers, and contribute to the development of web applications.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Android Developer",
    "description": "Produce technical designs and lead developers during development. Solid understanding of the full mobile development life cycle.&hellip;",
    "skills": []
  },
  {
    "job_title": "Bincom Dev Center Tech/Software Training Facilitator (Freelance/Part-Time)",
    "description": "This is a part-time/freelance role for individuals able to commit to learning and development of the next generation of technology experts and software…&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "Collaborating with other developers using Agile, Scrum, or Kanban methodologies. Writing clean, efficient, and maintainable code in programming languages like…&hellip;",
    "skills": []
  },
  {
    "job_title": "Full-Stack Developer - Beauty Marketplace",
    "description": "Optimise for Nigerian mobile network conditions. Develop React Native app or PWA for iOS/Android. *Backend:* Supabase (PostgreSQL, real-time subscriptions).&hellip;",
    "skills": []
  },
  {
    "job_title": "IOS Developer",
    "description": "Security: Familiarity with mobile security best practices. Full mobile development lifecycle: 4 years (Preferred). Experience with Realm is a plus.&hellip;",
    "skills": []
  },
  {
    "job_title": "Finance & Back Office Manager",
    "description": "Hyper, a mobile games publisher, is building the next-generation mobile gaming platform. Your *Itch.io, or personal website showcasing past work*.&hellip;",
    "skills": []
  },
  {
    "job_title": "Android Engineer",
    "description": "Collaborate with the server-side developers to design the APIs for specifically for the Android application (not just consuming APIs that were already developed…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Technical Lead - Digital Solutions",
    "description": "(c) Support developers in documenting code specifications and versioning for references and maintenance. (b) Create low-level designs covering all components…&hellip;",
    "skills": []
  },
  {
    "job_title": "SENIOR TECHNICAL LEAD-DIGITAL SERVICES & EMERGING TECHNOLOGIES AT IKOYI, LAGOS",
    "description": "Development, enterprise web and app evolution, mobile advertising, partner management, Internet. (c) Support developers in documenting code specifications and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Backend Developer - WDK (100% Remote - Nigeria)",
    "description": "The Wallet Development Kit (WDK) Software Engineer contributes to Tether's open-source toolkit for building self-custodial wallet applications across mobile and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior iOS Engineer",
    "description": "Knowledge of mobile UI/UX design principles and usability best practices. Extensive experience in iOS app development, with a strong command of Swift…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Infrastructure & DevOps Engineer",
    "description": "Experience supporting mobile app backend infrastructure. Work with developers, QA, product managers, and external vendors to align infrastructure with business…&hellip;",
    "skills": []
  },
  {
    "job_title": "Brand Manager",
    "description": "Manage advertising, showcasing of products and other forms of marketing to maintain consistency in branding. Develop strategies and manage marketing campaigns,…&hellip;",
    "skills": []
  },
  {
    "job_title": "SDET – Software QA Automation",
    "description": "Collaborate closely with product managers, engineers, and designers to identify acceptance criteria and define test coverage.&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager",
    "description": "Ii. Proven track record in a similar role as a product and project manager. I. Stay abreast of industry trends and competitor products, conducting thorough…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager",
    "description": "Adjustments to achieve product success. Create and manage product roadmaps, ensuring alignment with overall. Gather and analyze user feedback to inform product…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager",
    "description": "The role involves overseeing product strategy, feature development, and user experience across digital platforms.&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Product Manager",
    "description": "Hands-On Product Development: Practical experience in building and launching software products, with a clear understanding of the product lifecycle.&hellip;",
    "skills": []
  },
  {
    "job_title": "Associate Product Manager",
    "description": "Support product development across the company’s products and services. We are looking for a dynamic and creative Associate Product Manager who can support both…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager",
    "description": "Lead the product development lifecycle from ideation to delivery. Conduct market and competitive analysis to inform product decisions.&hellip;",
    "skills": []
  },
  {
    "job_title": "FMCG Product Project Manager",
    "description": "Experience in managing product development in consumer packaged goods categories such as food, beverage, household products, or personal care.&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager",
    "description": "*Translate complex business requirements into clear, actionable product specifications and user stories.*. *Create and manage product roadmaps, backlogs, and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Growth Manager",
    "description": "Proven experience (3+ years) in product management, and experience in financial products an added. Ensure all product strategies and offerings meet regulatory…&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Product Manager",
    "description": "Monitor and report on product/ feature usage results. Coordinating findings with the product team and aligning them with business goals.&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager",
    "description": "Take ownership and manage the assigned product through all phases of the product life cycle. Develop product pricing and positioning strategies.&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Designer /Enterprise Product Manager",
    "description": "If you're passionate about crafting intuitive, user-focused enterprise products _and_ can also shape product strategy and roadmaps, this role is for you.&hellip;",
    "skills": []
  },
  {
    "job_title": "Crypto Product Manager (Nigeria-Remote)",
    "description": "Product Strategy Development: Identify opportunities for new products and enhancements to existing products based on market research, competitive analysis, and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager",
    "description": "Quarterly product roadmap with milestones and tracked progress. Strong knowledge of Agile, Scrum, and product development methodologies.&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager",
    "description": "You will be the vital link between our engineering capacity and our core business objectives with responsibility for the successful implementation and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Product Manager",
    "description": "At least 6 years of experience as a product manager. Transform customer insights into product vision by becoming the go-to expert who deeply understands…&hellip;",
    "skills": []
  },
  {
    "job_title": "Telco product and project manager",
    "description": "• Provide comprehensive product management and support for products, ensuring alignment with*. • Ensure the quality of content and notifications aligns with…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager",
    "description": "Develop product-related sales and marketing materials, ensuring effective communication of product value and benefits.&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager",
    "description": "Strong portfolio and a good track record as a product manager. Manage the product throughout the Product Lifecycle, gathering and prioritizing product and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager",
    "description": "3+ years of product management experience, with at least 2 years focused on mobile app products. Define product requirements and ensure clear communication…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager",
    "description": "Experience working in a startup or fast-paced product environment. Lead sprint planning, backlog grooming, and product delivery cycles.&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager – Payment Infrastructure (Nigeria)",
    "description": "Collaborate with global product and engineering teams at HQ while owning all local provider operations. Translate local provider documentation and behavior into…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Management Associate",
    "description": "Preferred exposure to Edtech or SaaS products. Analyze product performance and user behavior to guide continuous improvements.&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager, Employee Experience",
    "description": "Should have 8 years product management experience, preferably in a service-based or operations-heavy environment.&hellip;",
    "skills": []
  },
  {
    "job_title": "PRODUCT MANAGER",
    "description": "Gathering and prioritizing product and customer requirements. Demonstrated success defining and launching excellent products and generating sales.&hellip;",
    "skills": []
  },
  {
    "job_title": "Fiat Product Manager",
    "description": "Exposure to launching payment products in Africa, LATAM, or Asia. Familiarity with compliance, risk, and regulatory frameworks for fiat products.&hellip;",
    "skills": []
  },
  {
    "job_title": "Relationship Manager",
    "description": "Facilitate the provision of product quotes to prospect. The Relationship Management Executive (RME) / Relationship Manager (RM) / will be expected to initiate,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager",
    "description": "Determine product strategy that aligns with Gurugeek's complex product ecosystem, considering industry trends, vendor marketspace, and organizational priorities…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Product Manager",
    "description": "- Develop and maintain product roadmaps. - Prioritize and manage the product backlog. - Track product performance and key metrics. What We’re Looking For*:&hellip;",
    "skills": []
  },
  {
    "job_title": "Enterprise Product Manager",
    "description": "Define and analyze success metrics for products. Strong understanding of modern product management and development practices. Be on a Mission that Counts.&hellip;",
    "skills": []
  },
  {
    "job_title": "Product manager, Academy",
    "description": "Should have 8 years product management experience, preferably in a service-based or operations-heavy environment. WHAT YOU'LL BE DOING.&hellip;",
    "skills": []
  },
  {
    "job_title": "OTC Product Manager",
    "description": "Experience in managing product portfolios and launching new products. Lead product launches, relaunches, and lifecycle management activities.&hellip;",
    "skills": []
  },
  {
    "job_title": "STORE MANAGER (SURULERE,IKEJA,ABULE-ADO)",
    "description": "Maintain comprehensive knowledge of all products available at the store. Provide timely feedback on new product performance and price changes.&hellip;",
    "skills": []
  },
  {
    "job_title": "Customer Relationship Manager",
    "description": "Ultimately, an outstanding customer relationship manager will work closely with sales and accounts managers to ensure that all staff preserves relationships…&hellip;",
    "skills": []
  },
  {
    "job_title": "Head of Product Growth",
    "description": "Oversee the entire product lifecycle from ideation to launch, ensuring products meet and exceed customer expectations.&hellip;",
    "skills": []
  },
  {
    "job_title": "Operations Manager",
    "description": "Collaborate cross-functionally with product, customer support, and vendor growth. Build and lead SAMU’s operations team: riders, fleet managers, support agents.&hellip;",
    "skills": []
  },
  {
    "job_title": "ASISSTANT STORE MANAGER with Supermarket Bakgound - ABUJA",
    "description": "Ensure availability of merchandise and marketing products in store. Have sound knowledge of technology products and the current retail environment.&hellip;",
    "skills": []
  },
  {
    "job_title": "BRAND AND COMMUNICATIONS MANAGER",
    "description": "Collaborate with marketing, PR, and product teams to align communication efforts. Develop and implement comprehensive brand communication strategies.&hellip;",
    "skills": []
  },
  {
    "job_title": "Livestock Manager",
    "description": "Identify new market opportunities and expansion prospects for farm products. Rest of Nigeria (Edo) Full Time. The Livestock Manager will oversee the operational…&hellip;",
    "skills": []
  },
  {
    "job_title": "Logistics Manager",
    "description": "The Logistics Manager will collaborate closely with various internal departments (sourcing, production, sales, finance) and external stakeholders (suppliers,…&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Service Manager",
    "description": "The service manager maintains a strong working knowledge of all industry standards and practices as well as the company's products and services.&hellip;",
    "skills": []
  },
  {
    "job_title": "PRODUCT MANAGER",
    "description": "Define and own the product roadmap. Drive agile product sprints: lead sprint planning, backlog grooming, and daily stand-ups.&hellip;",
    "skills": []
  },
  {
    "job_title": "Inventory Manager",
    "description": "Monitor expiry dates and batch numbers of pharmaceutical products. Coordinate with sales floor staff to understand fast-moving products.&hellip;",
    "skills": []
  },
  {
    "job_title": "Finance & Accounts Manager",
    "description": "Handle product purchase management and procurement processes. Maintain financial records, including transactions, monthly/weekly financial projections,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Branch Manager (Abuja)",
    "description": "The Branch manager will be un charge of the operations and business growth of the branch assigned, overseeing the productivity of employees and influencing…&hellip;",
    "skills": []
  },
  {
    "job_title": "Manager (Nnewi Branch)",
    "description": "Coordinate product distribution and delivery logistics. Supervise daily operations of the water production facility. Job Types: Full-time, Permanent.&hellip;",
    "skills": []
  },
  {
    "job_title": "Restaurant Operation Manager",
    "description": "Implement standard operating procedures (SOPs) and maintain consistency in product quality and service standards.&hellip;",
    "skills": []
  },
  {
    "job_title": "Warehouse Manager",
    "description": "Develop and enforce quality assurance protocols to ensure all products meet industry and regulatory requirements. Ibadan & Oyo State Full Time.&hellip;",
    "skills": []
  },
  {
    "job_title": "QA Manager-Flexible Packaging Kano",
    "description": "Oversee testing procedures, inspection criteria, and documentation to maintain consistent product quality. Salary Range:* 350,000 - 400,000 Monthly (Negotiable…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Product Manager, Compliance",
    "description": "✅ Deeply analytical and comfortable leveraging data to improve product and process. History of aligning compliance and product goals to drive both safety and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior Hub Manager (Oyo, Ekiti, Ondo, Kwara, Osun, Ogun, Delta, Imo, Anambra)",
    "description": "Coaching Jaza stars on Customer service - (Proper customer and product education, Proper language and tone to use, answering questions, and resolving/ reporting…&hellip;",
    "skills": []
  },
  {
    "job_title": "Business Development Manager",
    "description": "To plan and carry out all sales activities of Novonesis Household Care products in assigned region. Member of Industry Group Network made up of Industry Group…&hellip;",
    "skills": []
  },
  {
    "job_title": "Operations Manager",
    "description": "We are seeking an experienced Operations Manager to oversee the day-to-day activities of our real estate company. Strong analytical and problem-solving skills.&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Owner",
    "description": "Deep experience in Agile/Scrum product development environments. Proven ability to drive product optimization using data and experimentation.&hellip;",
    "skills": []
  },
  {
    "job_title": "Brand and Communications Manager",
    "description": "Work closely with cross-functional teams, including marketing, sales, and product development, to ensure that communications are aligned with business…&hellip;",
    "skills": []
  },
  {
    "job_title": "General Assistant",
    "description": "Advise and assist Customers on correct products and queries. Ensure comprehensive Customer service in Store. Merchandising of stock, shelf price labelling and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager - Growth",
    "description": "Experience working in Agile environments and familiarity with product development frameworks. A desire to build something great, contributing to an impactful…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Technical Product Manager (100% remote - Nigeria)",
    "description": "5+ years of product management experience with at least 3 years in a technical product management role. You’ll collaborate with developers, designers, and…&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Designer",
    "description": "Remote (Work From Home) Full Time. You’ll be responsible for designing engaging user experiences and sleek interfaces for web, mobile, and software applications…&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Designer",
    "description": "The ideal candidate will play a key role in enhancing our customers’ digital shopping experience by designing intuitive, user-centered interfaces across our web…&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Designer",
    "description": "In this role, you will work closely with Design, Marketing and Product teams to design engaging digital experiences across our website, design templates, and…&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Designer",
    "description": "Remote (Work From Home) Full Time. Gather and evaluate user requirements in collaboration with product managers and engineers.&hellip;",
    "skills": []
  },
  {
    "job_title": "UI Designer",
    "description": "Collaborate with UX designers to ensure designs are user-centric and meet project goals. Remote (Work From Home) Full Time. Minimum of 1 year experience.&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Designer (Mid to Senior Level) – Remote (Nigeria)",
    "description": "Job Type: *Full-Time Role Summary Alpha Global is seeking a creative and detail-oriented UI/UX Designer to craft intuitive and engaging user interfaces for web…&hellip;",
    "skills": []
  },
  {
    "job_title": "JUNIOR UI/UX DESIGNER",
    "description": "Collaborate with the senior designer to create wireframes, prototypes, and high-fidelity mock-ups. He/she will work closely with the UI/UX designer to bring the…&hellip;",
    "skills": []
  },
  {
    "job_title": "Figma UI/UX Designer",
    "description": "You take pride in creating exceptional user experiences for mobile and web applications and excel at solving technical challenges. Experience with CSS and HTML.&hellip;",
    "skills": [
      "css",
      "excel"
    ]
  },
  {
    "job_title": "UI/UX Designer",
    "description": "Remote (Work From Home) Full Time. As a UI/UX Designer at Kenkeputa, you will collaborate with product managers, developers, and other stakeholders to create…&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Designer",
    "description": "Collaborate with the marketing and creative teams to understand project requirements and objectives. Design visual concepts, graphics, and layouts for marketing…&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX & Graphics Designer",
    "description": "Accommodation*: Full accommodation provided, *compulsory* from Monday 8am to Friday 3pm. As a UI/UX & Graphics Designer, you will be responsible for designing…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Graphics UI/UX Motion Designer",
    "description": "Your work will directly impact how users interact with our dashboards, onboarding flows, and transactional interfaces—turning friction into delight.&hellip;",
    "skills": []
  },
  {
    "job_title": "Creative UI/UX Desiger",
    "description": "Experience Level:* Mid-Level (2–5 years preferred). You will be responsible for designing user-friendly, visually engaging, and functional digital products for…&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Graphics Designer",
    "description": "The ideal candidate will have a strong grasp of design principles, user experience, and visual storytelling. Develop intuitive UI/UX designs for web and mobile…&hellip;",
    "skills": []
  },
  {
    "job_title": "Ul/UX Designer",
    "description": "Collaborating with the marketing team, and internal and external designers to ensure the creation and delivery of tailored experiences for the digital user.&hellip;",
    "skills": []
  },
  {
    "job_title": "UI-UX Designer/ Graphics designer",
    "description": "This is a unique opportunity for a passionate designer to collaborate with cross-functional teams and bring visions to life. Job Type: Onsite *(Full-time).&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Designer",
    "description": "Remote (Work From Home) Full Time. Real Estate NGN 400,000 - 600,000. We are looking for a skilled professional with at least four (4) years of experience and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphics Designer",
    "description": "Zhongxin Network Technology Co. Ltd. You will create visual designs, including logos, websites, advertisements, and product packaging to sell our brand.&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Developer",
    "description": "Proven experience as a frontend designer (using a frontend framework such as Angular, ReactJS, Vue, etc.) or considerable knowledge of the field.&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphics Designer",
    "description": "Seinde Signature Limited *is a luxury fragrance brand that embodies sophistication, individuality, and timeless elegance. What We’re Looking For:&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer",
    "description": "Reports to: Head of Marketing or Creative Director. You will be responsible for producing visually engaging and brand-aligned content across digital platforms.&hellip;",
    "skills": []
  },
  {
    "job_title": "Mid-Level UI/UX Designer / AI Specialist",
    "description": "11PM-8AM Central Standard Time. You'll collaborate with cross-functional teams to bring smart, data-informed design solutions to life—crafting everything from…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer",
    "description": "The ideal candidate should have a robust portfolio demonstrating expertise in creating visually captivating designs across various mediums.&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer",
    "description": "Minimum of 2 years of proven experience as a graphic designer, with a strong portfolio showcasing both static and motion design projects.&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer/E Commerce Digital Marketer",
    "description": "- Collaborate with UI/UX designers to create visually appealing and intuitive user interfaces.*. \\*This position requires living on job site\\**.&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Engineer",
    "description": "Collaborate with designers and engineers to ensure design consistency and feasibility. We're seeking an experienced UI/UX Engineer, who will be responsible for…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer",
    "description": "The ideal candidate will have a strong portfolio showcasing both creativity and a deep understanding of design principles. Graphic Design: 5 years (Required).&hellip;",
    "skills": []
  },
  {
    "job_title": "Brand Designer",
    "description": "We are seeking a creative and detail-oriented Brand Designer to develop and maintain a strong visual identity across digital and print platforms.&hellip;",
    "skills": []
  },
  {
    "job_title": "Multimedia Designer",
    "description": "Reports to: Head of Marketing or Creative Director. We are a fast-growing fintech company based in Abuja, building the future of digital finance in Africa.&hellip;",
    "skills": []
  },
  {
    "job_title": "Front-End Developer",
    "description": "Collaborate with backend developers and UI/UX designers to implement features. Job Title:* Frontend Developer (Remote, 3-Month Contract).&hellip;",
    "skills": []
  },
  {
    "job_title": "Wed Designer",
    "description": "As our Web Designer, you’ll play a dual role blending design aesthetics with development logic. You’ll collaborate with our frontend and backend teams to design…&hellip;",
    "skills": []
  },
  {
    "job_title": "Customer Success Associate (Technical Based)",
    "description": "This position is available for candidates working as product designers, web designers, web developers, etc. without customer support experience.&hellip;",
    "skills": []
  },
  {
    "job_title": "User Experience Designer (Intern)",
    "description": "Collaborating with the marketing team, and internal and external designers to ensure the creation and delivery of tailored experiences for the digital user.&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphics Designer",
    "description": "A designer who sees beyond aesthetics to how design shapes user experiences. Adobe Creative Suite Excellent information design and data visualization abilities…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer",
    "description": "Advertising, Media & Communications NGN 150,000 - 250,000 Negotiable Plus Commission. Jira canva Adobe Creative Suite Google Drive/Dropbox Capcut After Effects.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior UI/UX Designer / AI Expert",
    "description": "Leadership: Experience mentoring junior designers and leading design sprints that incorporate AI innovation. 11PM-8AM Central Standard Time.&hellip;",
    "skills": []
  },
  {
    "job_title": "Quality Assurance Engineer",
    "description": "Collaborate closely with developers, product managers, data scientist and designers to understand requirements and define quality standards.&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer",
    "description": "Work closely with clients, marketing teams, and other designers to understand project requirements. The ideal candidate will conceptualize, design, and execute…&hellip;",
    "skills": []
  },
  {
    "job_title": "Flutter Developer",
    "description": "Collaborate with UI/UX designers to implement designs into functional apps. Remote (Work From Home) Full Time. Integrate APIs and third-party libraries.&hellip;",
    "skills": []
  },
  {
    "job_title": "3D Game Designer / Graphics Artist",
    "description": "2D 3D Photoshop Illustrator Blender Maya Game UI/UX design principles Character Animation graphics Artist. The ideal candidate will bring our game concepts to…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer and Social Media Manager",
    "description": "Work Schedule: Full time: Monday – Friday, 9:00 AM – 5:00 PM. The ideal candidate will be responsible for designing compelling graphics and managing all social…&hellip;",
    "skills": []
  },
  {
    "job_title": "Next js Frontend Developer (Typescript, Tailwind and Rest API consumption) Expert",
    "description": "UX Product designers and back-end developers to implement user-friendly interfaces based on provided figma designs and specifications. Do you have live project?&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Design Marketing Intern",
    "description": "The agency specializes in services such as website design & development, UI/UX design, CRM setup & automation, digital marketing, SEO, and content strategy.&hellip;",
    "skills": []
  },
  {
    "job_title": "WordPress Developer",
    "description": "Collaborate with UI/UX designers and content teams to deliver seamless user experiences. Experience Level:* Mid-Level (2–5 years preferred).&hellip;",
    "skills": []
  },
  {
    "job_title": "Motion Graphics Designer & Illustrator (Onsite)",
    "description": "Proven experience (2–4 years) as a motion graphics designer & illustrator. We are looking for a creative and experienced Motion Graphics Designer & Illustrator…&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Developer",
    "description": "Collaborate with designers and other developers to execute projects efficiently. Design and develop responsive websites and web applications.&hellip;",
    "skills": []
  },
  {
    "job_title": "Software Engineer",
    "description": "Work with designers to translate UI/UX mockups into working features. You’ll collaborate with product managers, designers, and cross-functional teams to deliver…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile App Developer (Mid to Senior Level) – Remote (Nigeria)",
    "description": "Collaborate with UI/UX designers to implement user-friendly and responsive app interfaces. Alpha Global seeks a skilled Mobile App Developer experienced in…&hellip;",
    "skills": []
  },
  {
    "job_title": "NYSC/ Graduate Trainee",
    "description": "Work closely with developers, designers, and business teams to execute projects effectively. Retail, Fashion & FMCG NGN 75,000 - 150,000.&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend Developer",
    "description": "Collaborate with back-end developers and web designers to improve usability. Abeokuta & Ogun State Full Time. Proven work experience as a Front-End Developer or…&hellip;",
    "skills": []
  },
  {
    "job_title": "Frontend Developer",
    "description": "Collaborating closely with UI/UX designers to translate wireframes and mockups into functional, responsive, and aesthetically pleasing code.&hellip;",
    "skills": []
  },
  {
    "job_title": "React Native Developer",
    "description": "Work closely with UI/UX designers and backend engineers to integrate APIs and deliver seamless experiences. Implement features that support ordering, inventory…&hellip;",
    "skills": []
  },
  {
    "job_title": "Front End Developer",
    "description": "Collaborate with designers to turn UI/UX designs into working code. Eunantech is looking for a skilled and creative Front-End Developer to help us build clean,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Dart/Flutter Developer",
    "description": "Collaborate with product managers, designers, and backend developers to deliver cohesive and robust applications. Strong communication and interpersonal skills.&hellip;",
    "skills": []
  },
  {
    "job_title": "Mobile Developer",
    "description": "Work closely with product owners, UI/UX designers, and backend developers to translate requirements into functional, high-performance apps.&hellip;",
    "skills": []
  },
  {
    "job_title": "Shopify Developer",
    "description": "Work closely with designers to translate wireframes and mockups into functional Shopify websites. You will collaborate with designers, marketers, and project…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Design Tutor",
    "description": "DYB Africa is looking for a creative and detail-oriented *Product Designer (UI/UX)* to join our growing team. In this role, you’ll help design digital products…&hellip;",
    "skills": []
  },
  {
    "job_title": "Fullstack Develpoer",
    "description": "Collaborate with backend developers, designers, and product managers to define app features and user flows. Rest of Nigeria (Nationwide) Full Time.&hellip;",
    "skills": []
  },
  {
    "job_title": "Creative Manager",
    "description": "Lead and manage the creative team, including web designers, UI/UX designers, graphic designers, and other creative professionals.&hellip;",
    "skills": []
  },
  {
    "job_title": "Solutions Architect",
    "description": "Collaborate with business analysts, designers, and client stakeholders. We’re especially interested in individuals who embrace modern AI tools and patterns as…&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Support Specialist",
    "description": "In-app chat for CRM support. In-app chat for CRM support is a plus. Provide periodic reports on system health, support trends, and improvement opportunities.&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Specialist",
    "description": "Provide fast and efficient technical support to resolve any issues promptly. Remote (Work From Home) Full Time. Knowledge and experience with VPNs.&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Support Specialist",
    "description": "Minimum 1 year of experience in a field technical support role. Rest of Nigeria (Edo) Full Time. In this role, you will be responsible for the preparation,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Customer Service Specialist – IT & Power Service",
    "description": "Familiarity with CRM tools and customer support best practices. Minimum 3 years' experience in customer support or client service.&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Security Specialist",
    "description": "Provide technical support and training to staff on IT tools, cybersecurity awareness, and safe usage practices. Abeokuta & Ogun State Full Time.&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Support Specialist",
    "description": "Manage and support applications deployed by the organization. Experience in networking, cybersecurity, and general IT infrastructure support.&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Support Engineer",
    "description": "Obtaining replacement or specialist components, fixtures, or fittings. The IT support engineer will be mainly responsible for the smooth running of computer…&hellip;",
    "skills": []
  },
  {
    "job_title": "Analyst & Business Support Specialist",
    "description": "Conduct comprehensive business research and market analysis to support client decision-making. Remote (Work From Home) Part Time.&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Operations Specialist",
    "description": "Lead the IT team, including technicians and support staff. Provide technical support for cross-functional projects and departmental needs.&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Specialist",
    "description": "The ideal candidate will be responsible for providing comprehensive IT support, ensuring the smooth operation of our IT infrastructure, and assisting with…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Testing Coordinator & Technical Support Specialist",
    "description": "Track and analyze technical support trends to identify product improvement opportunities. The role also provides front-line technical support to customers,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mental Health and Psychosocial Support (MHPSS) Officer - Katsina",
    "description": "Work closely with education, and child protection teams to ensure holistic support for children. Ensure the provision of age-appropriate, culturally relevant…&hellip;",
    "skills": []
  },
  {
    "job_title": "Learning Support Specialist",
    "description": "Assist with the development of support materials and resources. Provide timely and effective support to students via various channels (email, chat, phone).&hellip;",
    "skills": []
  },
  {
    "job_title": "I.T Support Officer",
    "description": "IT support : 3 years (Preferred). . Respond to IT support requests in a timely and professional manner. . Escalate complex issues to relevant IT specialists or…&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Specialist",
    "description": "3+ years of experience in IT support or a similar role. Respond to and resolve IT support tickets in a timely and efficient manner.&hellip;",
    "skills": []
  },
  {
    "job_title": "Support Specialist",
    "description": "Assist clients with onboarding, uploading ,troubleshooting, and technical support. Provide administrative support such as answering calls, data entry, filing,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Country Security Specialist",
    "description": "Arrange continuing or special host government protective services support for staff, visiting missions and facilities as necessary.&hellip;",
    "skills": []
  },
  {
    "job_title": "Content Specialist",
    "description": "The role involves creating engaging content to support sales activations and managing content strategy for various platforms.&hellip;",
    "skills": []
  },
  {
    "job_title": "Ariosh Limited Recruitment for IT Trainee",
    "description": "Provide technical support to end-users and assist with hardware, software, and network-related issues. Support system setup, user account management, and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Network and Server/Storage Specialist",
    "description": "Provide Level 2/3 support for infrastructure-related incidents. Collaborate with other IT teams (Helpdesk, DevOps, Cloud) to support business operations and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Technical Specialist",
    "description": "Hardware Support: Ability to troubleshoot and support end-user devices. Provide user support and training for software, cloud platforms, and office technologies…&hellip;",
    "skills": []
  },
  {
    "job_title": "Quality Inspector",
    "description": "Non-conformance management and continuous improvement support. The Site (Factory / Sourcing Unit) Quality role supports the implementation of Unilever…&hellip;",
    "skills": []
  },
  {
    "job_title": "Project Geophysicist (Geotechnical Investigations Specialist)- Nigeria",
    "description": "Provide expert geophysical support to geotechnical teams by conducting and interpreting MASW, electrical resistivity, crosshole seismic, and thermal resistivity…&hellip;",
    "skills": []
  },
  {
    "job_title": "Customer Success Specialist",
    "description": "✅ Monitor client progress and provide ongoing support to enhance their learning journey. In this role, you will play a crucial part in ensuring customer…&hellip;",
    "skills": []
  },
  {
    "job_title": "People Specialist",
    "description": "Provide functional support for incentive programs. Through world-class consultation, innovative IT solutions and personalized client services, Cavista increases…&hellip;",
    "skills": []
  },
  {
    "job_title": "People Data and Operations Specialist | Nigeria",
    "description": "Provide support for ad-hoc projects within the People Ops team. Assist in forecasting workforce trends (e.g., attrition, hiring needs, skill gaps) using…&hellip;",
    "skills": []
  },
  {
    "job_title": "Training Content Development and Curation Specialist",
    "description": "Facilitate training in structured learning journeys, workshops, and e-learning modules to support global training initiatives. At least a university degree.&hellip;",
    "skills": []
  },
  {
    "job_title": "Chief Technology Officer (CTO)",
    "description": "Evaluate and recommend appropriate technologies, platforms, and tools to support business objectives. The CTO is responsible for providing strategic and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Emergency and Resilience Specialist",
    "description": "Provide support, information and regular updates to the Food Security and Agriculture Cluster (FSAC). Manage and supervise the daily work of the emergency and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mid-Level UI/UX Designer / AI Specialist",
    "description": "Research Know-How: Proficiency in user research methods, usability testing, and behavior analysis, with some experience using AI to support these tasks.&hellip;",
    "skills": []
  },
  {
    "job_title": "Talent Specialist",
    "description": "Provide guidance and support to managers in addressing performance issues, identifying development opportunities, and implementing performance improvement plans…&hellip;",
    "skills": []
  },
  {
    "job_title": "Fraud Investigations Specialist",
    "description": "Follow up on real fraud leads—cases flagged by our analysts that need boots-on-the-ground action. Track down people and data using addresses, phone numbers,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Geotechnical Engineer (Report Specialist) - Real Estate for Nigeria",
    "description": "Achyutam International - Consulting in HR & Finance. Experience: 3-5 years in geotechnical analysis & reporting. Employment Type: [Full-time/Contract].&hellip;",
    "skills": []
  },
  {
    "job_title": "Civil Engineer/Specialist III",
    "description": "Read, write, and speak fluent English, especially as it applies to technical and business communications. Considered an expert in Civil Engineering.&hellip;",
    "skills": []
  },
  {
    "job_title": "Fraud - Field Specialist",
    "description": "Follow up on real fraud leads—cases flagged by our analysts that need boots-on-the-ground action. Track down people and data using addresses, phone numbers,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Fraud Specialist",
    "description": "Conduct fraud awareness training sessions for staff and support a culture of ethical behavior. The Fraud Specialist will be responsible for identifying,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Onboarding and KYC Specialist",
    "description": "Provide ongoing support to service providers and clients through our administrative console. Recommend improvements to onboarding and support processes based on…&hellip;",
    "skills": []
  },
  {
    "job_title": "Middle+ Partnerships & Communications Specialist (Epoche)",
    "description": "If it feels aligned, we'll move forward with an interview. Education support, participation in industry events, and work-related travel.&hellip;",
    "skills": []
  },
  {
    "job_title": "Procurement Contract Specialist II",
    "description": "And we're not just talking about it; we're doing it. Construction services to support project execution. Negotiate terms & conditions, prepare contracts, and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer / AI Specialist",
    "description": "You’ll use your design skills and AI tools to develop high-quality graphics that support branding, marketing, and communication goals for a variety of clients.&hellip;",
    "skills": []
  },
  {
    "job_title": "Digital Marketing Specialist - Remote",
    "description": "Collaborate with cross-functional teams to support product launches, events, and marketing initiatives. This opportunity is ideal for individuals looking to…&hellip;",
    "skills": []
  },
  {
    "job_title": "Supply Chain Specialist",
    "description": "Financial support for special events in your life; Providing support throughout the implementation process by answering questions from development teams;&hellip;",
    "skills": []
  },
  {
    "job_title": "Operational Specialist",
    "description": "We are seeking highly experienced Operational Specialist to support the delivery of job instructions, simulation-based training, and competency development for…&hellip;",
    "skills": []
  },
  {
    "job_title": "Cybersecurity Analyst",
    "description": "You will be responsible for delivering expert guidance in the design, implementation and assessment of cybersecurity frameworks & controls, in alignment with…&hellip;",
    "skills": []
  },
  {
    "job_title": "Head of Unit, IT Infrastructure Management",
    "description": "Lead a team of IT infrastructure specialists, ensuring skill development and operational efficiency. Collaborate with other IT units to support digital banking…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Delivery Consultant",
    "description": "A key part of your role will be to implement business transformation and digital transformation programs mainly into the mining, banking or telco sectors,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Steward Umuahia",
    "description": "Research unusual symptoms and treatment options, through consultation with physicians and other medical specialists. Knowledge of basic maintenance process.&hellip;",
    "skills": []
  },
  {
    "job_title": "Bids/Tender Specialist",
    "description": "Monitoring of the bid management in order to ensure it is aligned with ARIT’s requirements. Proven experience in winning contracts, delivering within agreed…&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Phone Sales Agent",
    "description": "Collaborate closely with internal teams, including sales managers, solution architects, and technical specialists, to develop tailored sales strategies and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Middle+ SMM Specialist (Epoche)",
    "description": "Developing a content strategy for Instagram and TikTok. Executing this strategy (briefing, script writing, managing designers, and sourcing/managing contractors…&hellip;",
    "skills": []
  },
  {
    "job_title": "HR and Recruitment Specialist",
    "description": "This role requires an experienced HR professional who can handle day-to-day HR and administrative functions while leading end-to-end recruitment processes to…&hellip;",
    "skills": []
  },
  {
    "job_title": "AI Transformation Specialist",
    "description": "Define use-case briefs, build proof-of-concept pilots with internal or external AI partners, and support implementation. Operationalize AI Use Cases.&hellip;",
    "skills": []
  },
  {
    "job_title": "Chief Technology Officer",
    "description": "Lead and mentor a team of technology professionals, including software developers, engineers, and IT specialists and foster a culture of collaboration,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Training Content Development and Curation Specialist",
    "description": "Continuously seek feedback on your courses and use it to improve content efficiently. Facilitate training in structured learning journeys, workshops, and e-…&hellip;",
    "skills": []
  },
  {
    "job_title": "Finance Specialist",
    "description": "Collaborate with other departments to provide financial insights and support. The ideal candidate will ensure compliance with financial regulations, assist with…&hellip;",
    "skills": []
  },
  {
    "job_title": "Multi-Skilled Handyman",
    "description": "Approximately 5 years of relevant experience in building maintenance and technical support. Coordinate with IT specialists for equipment setups and make minor…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Specialist",
    "description": "Meet organizational targets while aiming to exceed it always. Ability to support tactical multi-channel marketing programs for the sales business unit.&hellip;",
    "skills": []
  },
  {
    "job_title": "IT Project Manager",
    "description": "5 years of related experience in customer facing, technology deployment and support environment. Provide sales team with technical and service presales support;…&hellip;",
    "skills": []
  },
  {
    "job_title": "Protection Information Management Officer - Nigeria",
    "description": "Assist in the development of simple data visualization tools for protection analysis with support from the PIM Specialist. BA./BSc. in relevant field.&hellip;",
    "skills": []
  },
  {
    "job_title": "Specialist Nurse Theatres",
    "description": "A range of businesses providing relevant health support will support this facility and provide commercial services to its patients and staff, thus creating a…&hellip;",
    "skills": []
  },
  {
    "job_title": "SDET – Software QA Automation",
    "description": "Collaborate closely with product managers, engineers, and designers to identify acceptance criteria and define test coverage.&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Designer (Mid Level)",
    "description": "In this role, you will collaborate with product managers, developers, and other designers to create intuitive and engaging designs that meet user needs and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Brand Designer",
    "description": "Build and document a complete brand asset library for product teams in 30 days. Train designers and engineers to use brand guidelines confidently (we’re aiming…&hellip;",
    "skills": []
  },
  {
    "job_title": "UI Designer",
    "description": "You will work closely with our product, development, and marketing teams to ensure that our digital products are not only beautiful but also user-friendly.&hellip;",
    "skills": []
  },
  {
    "job_title": "3D Product Designer",
    "description": "Excited about building innovative energy products for African markets. Generate realistic product renderings for marketing, investor decks, and internal review.&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Designer",
    "description": "Translate product specs and user behavior into design solutions. Your designs will guide our developers and elevate our digital products to world-class…&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Designer",
    "description": "Gather and evaluate user requirements in collaboration with product managers and engineers. Remote (Work From Home) Full Time.&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphics Designer",
    "description": "You will work closely with the marketing, branding, and product teams to bring concepts to life and ensure cohesive brand messaging.&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Designer /Enterprise Product Manager",
    "description": "2+ years in a product ownership or hybrid designer/PM role. If you're passionate about crafting intuitive, user-focused enterprise products _and_ can also shape…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior product designer",
    "description": "Mentor and provide guidance to junior designers. 5+ years of experience in product design. Lead the design of user-centered products that meet business…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphics Designer",
    "description": "Develop design concepts, graphics, and layouts for product illustrations, company logos, and websites. You will create visual designs, including logos, websites…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Designer (Intern)",
    "description": "We are looking for a Product Designer, who will be responsible for defining product specifications, identifying opportunities for new products, analyzing how a…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Graphics UI/UX Motion Designer",
    "description": "Stay ahead of *fintech UX trends* (e.g., neobanks, BNPL interfaces) and adapt insights to our PSP product. Collaborate with product teams to *storyboard motion…&hellip;",
    "skills": []
  },
  {
    "job_title": "Web Designer",
    "description": "Partner with marketing, content, and product teams to align design with strategic objectives. Remote (Work From Home) Full Time.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Product Designer",
    "description": "We are looking for Senior Product Designers with a great eye for detail and a passion for human-centered design... 4+ years of professional design experience.&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Designer",
    "description": "Collaborate with developers, product managers, and marketing to ensure seamless implementation of designs. The ideal candidate will play a key role in enhancing…&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Product Designer (UX)",
    "description": "Experience mentoring and guiding junior designers. Comfortable working in agile, fast-paced product teams. Partner closely with product managers and engineers…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Designer",
    "description": "We are looking for a Product Designer, who will be responsible for defining product specifications, Identifying opportunities for new products, Analyzing how a…&hellip;",
    "skills": []
  },
  {
    "job_title": "Creative Designer",
    "description": "Develop product walkthrough and show cases with animation effects. Remote (Work From Home) Full Time. Collaborate with our design and development teams to plan…&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Designer",
    "description": "Maintain and evolve a consistent design language across all products. As a UI/UX Designer at Kenkeputa, you will collaborate with product managers, developers,…&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Designer",
    "description": "Create UX wireframes and prototypes for new and existing product features. Proven experience in UI/UX design, ideally for web-based SaaS products.&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Designer (Mid to Senior Level) – Remote (Nigeria)",
    "description": "Opportunity to influence products used by various international users. Maintain and update design systems to ensure consistency across products.&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer & Marketing Assistant",
    "description": "Support event marketing and product launches with visual assets. Collaborating with the wider team on website updates and product launches.&hellip;",
    "skills": []
  },
  {
    "job_title": "GRAPHICS DESIGNER",
    "description": "Prepare digital product pitch presentations. Assist with copywriting and editing a variety of content across mediums that include: sell sheets, blogs, social…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphics Designer",
    "description": "Collaborate with marketing, product, and development teams to ensure consistent brand representation. Develop and execute creative concepts for marketing…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager",
    "description": "You will be the vital link between our engineering capacity and our core business objectives with responsibility for the successful implementation and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphics Designer",
    "description": "As a Graphics Designer, you will play a pivotal role in shaping the visual identity of our brand and products, your creative expertise will contribute to…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer",
    "description": "Developing concepts, graphics, and layouts for product Illustrations/Catalogs, Company Logo, and Website. Studying design briefs and determining requirements.&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphics Designer",
    "description": "Create graphics for social media, product packaging, websites, and advertisements that align with brand identity. Test graphics across various media.&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer",
    "description": "Proven experience as a graphics designer (portfolio required). Design marketing materials including banners, social media graphics, and product visuals.&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Designer (Mid to Senior Level) – Remote (Nigeria)",
    "description": "This role is ideal for designers with *5+ years of experience* in digital product design, interaction strategy, and UX research. Mid-Level UI/UX Designer*.&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphics Designer",
    "description": "Create visually stunning designs for branding, marketing campaigns, and product packaging. Develop graphics for both digital (social media, website, ads) and…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer",
    "description": "Support the strategic vision by producing creative visuals that align with the CEO's reputation as a visionary leader in media, entertainment, and consumer…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer",
    "description": "We are seeking a qualified Graphic designer to help design graphics for social media, flyers, posters, banners, and product packaging.&hellip;",
    "skills": []
  },
  {
    "job_title": "SEO Specialist",
    "description": "Familiarity with SaaS products, product marketing, or the B2B tech space. *Collaboration Skills*: Experience working cross-functionally with developers,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager",
    "description": "Adjustments to achieve product success. Create and manage product roadmaps, ensuring alignment with overall. Gather and analyze user feedback to inform product…&hellip;",
    "skills": []
  },
  {
    "job_title": "Multimedia Designer",
    "description": "Versatile Content Creation: Develop product illustrations, social media designs, logos, and other graphics for print and digital platforms.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior User Experience Designer",
    "description": "Experience mentoring and guiding junior designers. Comfortable working in agile, fast-paced product teams. Stay ahead of fintech trends and best practices to…&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX Graphics Designer",
    "description": "Collaborate with product managers, developers, and other stakeholders to implement user-centred design. You will be responsible for creating engaging graphics…&hellip;",
    "skills": []
  },
  {
    "job_title": "UI/UX & Graphics Designer",
    "description": "As a UI/UX & Graphics Designer, you will be responsible for designing intuitive, visually engaging user interfaces across various platforms and products.&hellip;",
    "skills": []
  },
  {
    "job_title": "Fashion Designer",
    "description": "*Team Leadership:* Direct and mentor junior designers, pattern makers, and seamstresses, fostering a creative yet disciplined work environment.&hellip;",
    "skills": []
  },
  {
    "job_title": "Crypto Graphic Designer (Nigeria-Remote)",
    "description": "Collaborate with the marketing and product teams to ensure consistent branding across all touchpoints. Conceptualize and execute creative assets for product…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer",
    "description": "The Graphics Designer & Video Editor is responsible for creating visual assets(creatives, motion graphics, & videos) that effectively communicate Tantacom…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphics Designer",
    "description": "Collaborate with product and engineering teams to implement designs. A designer who sees beyond aesthetics to how design shapes user experiences.&hellip;",
    "skills": []
  },
  {
    "job_title": "Junior to Mid-level Graphic Designer",
    "description": "Managing the custom process from designing to sampling to final product and admin around it. Full-time | Based at Versus HQ, Stellenbosch.&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer",
    "description": "Collaborate with marketing and product teams to create visuals that support campaigns, product launches, and user education.&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer Needed",
    "description": "Minimum 3 years experience – preference will be given to candidates with product illustration experience. Develop graphics and visual for product illustrations…&hellip;",
    "skills": []
  },
  {
    "job_title": "Brand Designer",
    "description": "*UI/UX Design and Digital Experience:* Design intuitive, user-centered interfaces for websites, apps, and digital products.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior UX/UI Designer",
    "description": "Experience mentoring and guiding junior designers. Comfortable working in agile, fast-paced product teams. Partner closely with product managers and engineers…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer",
    "description": "Develop graphics and visual or audio images for product illustrations, logos, and websites. The graphic designer is responsible for creating visual concepts…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphic Designer",
    "description": "A minimum of 2 years of experience as a graphic designer or similar role. Through The Business Analysis School, we specialize in business analysis, data…&hellip;",
    "skills": []
  },
  {
    "job_title": "Graphics Designer / Video Editor",
    "description": "Editing video content for various platforms. Designing graphics for marketing materials, and social media. Collaborating with marketing and creative teams.&hellip;",
    "skills": []
  },
  {
    "job_title": "Gaphics Designer",
    "description": "Responsibilities: *A high level of proficiency using Adobe products (or equivalent tools). Developing concepts, graphics and layouts for product illustrations,…&hellip;",
    "skills": []
  },
  {
    "job_title": "Mid-Level UI/UX Designer / AI Specialist",
    "description": "AI Familiarity: Practical understanding of integrating AI features such as chatbots, personalization engines, or predictive interfaces into product design.&hellip;",
    "skills": []
  },
  {
    "job_title": "Multimedia Designer",
    "description": "Collaborate with marketing and product teams to create visuals that support campaigns, product launches, and user education.&hellip;",
    "skills": []
  },
  {
    "job_title": "Furniture & Retail Product Designer (Architect)",
    "description": "Position: Furniture & Retail Products Designer (Architect). Salary: ₦150,000 – ₦200,000 (Based on experience and skill level).&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Manager",
    "description": "Take ownership and manage the assigned product through all phases of the product life cycle. Develop product pricing and positioning strategies.&hellip;",
    "skills": []
  },
  {
    "job_title": "Senior Web Designer",
    "description": "Web & App Design: Develop and refine product web designs, landing pages, email marketing templates, illustrations, and other graphics.&hellip;",
    "skills": []
  },
  {
    "job_title": "Customer Success Associate (Technical Based)",
    "description": "This position is available for candidates working as product designers, web designers, web developers, etc. without customer support experience.&hellip;",
    "skills": []
  },
  {
    "job_title": "Product Design Tutor",
    "description": "3+ years of professional experience in product design or UI/UX. In this role, you’ll help design digital products for our clients and internal platforms.&hellip;",
    "skills": []
  }
]